[
    {
            "title": "Role of Zakat in Business Growth and Empowerment Program: An Empirical Study",
            "author": "Mohammed Arshad Khan",
            "journal": "International Journal of Accounting and Taxation,",
            "serial": " 9(1), pp. 1-11",
            "doi": "10.15640/ijat.v10n1a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v10n1a1",
            "abstract": "As an Islamic economic and social funding device, Zakat is a tool that contributes to human well-being. This study explored the effect of zakat empowerment initiatives on Zakir wealth (the zakat beneficiary) in connection to business growth as a mediating variable. Partial Least Square Structural Equation Modelling (PLS-SEM) is used in this quantitative study to analyse 186 Indian zakat foundations from various zakat empowerment programmes. Zakir wealth increases as a result of Zakat empowerment. This shows that Zakir's wealth and business have grown as a result of the empowerment programme. Zakir wealth and business assistantship have a beneficial and considerable effect on company growth as a mediating variable. In addition, GRDP and inflation, as well as internal factors like as age and educational attainment, have varying effects on Zakir's wealth creation. According to this report, the zakat empowerment programme has a significant effect in enhancing the wealth of Zakir. Zakat commun                  ty empowerment is a way to reduce poverty and inequality in India, as well as a means of eradicating poverty.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "10",
            "issue": "1",
            "month": "June ",
            "year": "2022"
        },
    {
            "title": "The Determinants of Audit Fees: The Context of Cameroon",
            "author": "Samuel Tanjeh Mukah, Michael Forzeh Fossung, Kueda Wamba Berthelo, Samka Marion Nyuykighan",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "9(2), pp. 1-16",
            "doi": "10.15640/ijat.v9n2a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v9n2a1",
            "abstract": "This study examines the determinants of audit fees in the context of Cameroon. Data was collected using a questionnaire administered to 171 audit firms operating in Cameroon's Littoral, Center, and North-West Regions. The study used multilinear regression to analyse data; the findings reveal that audit fees in Cameroon are determined by the audit firm's experience, audit report lag, client complexity, duration of the mandate, and industry type.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "9",
            "issue": "2",
            "month": "December",
            "year": "2021"
        },
    {
            "title": "Endogenous Perception on Tonnage Tax Implementation: An Exploratory Study on Nigerian Shipping-Taxation",
            "author": "Zakari Baba Jibril, Dr Khadijah Bt. MohdIsa, Professor Rokiah Alavi, Dr Salwa Hana BintiYussof",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "9(1), pp. 1-11",
            "doi": "10.15640/ijat.v9n1a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v9n1a1",
            "abstract": "Tonnage tax is aninnovative regime that requires only size of a ship to determine tax payable. Theregime redressmost national-flagdecline which thisstudy explore Nigeria laggardness, despite media publicity5 of her implementation intention. The study uses a purposive sampling technique drawn from three agencies in Nigeria through snowballing. Data collected from participants was thematically analysed using ATLAS.ti8. Records triangulation and interviewee member checking were used to surge study validity. Result shows that top management, government employees and organization of the Nigeria shipping sector, play vital role on tonnage tax implementation. Using grounded theory data analysis technique, the study further generates relationship among codes which can be used as variables for quantitative researchers to reconfirm this theoretical development.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "9",
            "issue": "1",
            "month": "June",
            "year": "2021"
        },
    {
            "title": "Research on Tax Expense Surprise",
            "author": "Minwoo Lee",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "9(1), pp. 12-19",
            "doi": "10.15640/ijat.v9n1a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v9n1a2",
            "abstract": "Accounting for income taxes is one of the most complex and emerging areas in financial reporting. This area has a vast number of studies encompassing various aspects of tax reporting. Among those, this paper performs a comprehensive survey of studies in the realm of the pricing of tax expense information asone of the newest topics the accounting for income taxes research. Central to the tax expense research is tax expense surprise effect that results in a positive relationship between tax expense surprise and future, not contemporaneous, stock returns. This paper discussesnot only relevant studies on thiseffect and but possible causes of the effect. Although a number of studies confirm this effect, its cause is not clear. Given seemingly mixed and inconclusive evidence as to the cause, a cleaner test is proposed as a possible future research direction in this area.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "9",
            "issue": "1",
            "month": "June",
            "year": "2021"
        },
    {
            "title": "Exploring the Impact of Tariffs on Foreign Direct Investment and Economic Prosperity",
            "author": "Vanessa Fong, Dr. James N. Mohs",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(2), pp. 1-5",
            "doi": "10.15640/ijat.v8n2a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n2a1",
            "abstract": "The global economic environment has become more interconnected, a significant portion of which can be attributed to countries welcoming foreign businesses through foreign direct investments (FDI). FDI is powerful in its ability to grow and develop home companies while shaping host economies, which lays out a critical role in the generating opportunities, strengthening economies, and the circulation or velocity of capital. This paper extends the initial work of Ranish, Mentz and Mohs (2015) relating to global value chain decision making. The purpose of this research is to review and outline the sensitivity to Tariff’s on FDI and economic growth. The conclusions, recommendations and implications reached in this study are generalizable and appropriate for developing best practice solutions.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "2",
            "month": "December",
            "year": "2020"
        },
    {
            "title": "The Extent of the Jordanian Commercial Banks Applying the Targeted Cost and Realizing Its Importance: A Case Study of Commercial Banks in Karak Governorate/ Jordan",
            "author": "Tayseer Ali Al-Momani, Mazan Ahmed Alomari, Ali Falah al-zoubi",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(2), pp. 6-16",
            "doi": "10.15640/ijat.v8n2a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n2a2",
            "abstract": "This study aimed to show the extent of applying and importance the target cost approach in Jordanian commercial banks operating in the Karak region. To achieve this goal, an analytical descriptive approach was followed, as a questionnaire was prepared to collect the necessary data from the study sample that reached (50) respondents who were randomly chosen.The results of the analysis showed that there is an effect to understand the cost concept method used by workers in Jordanian commercial banks, as well as, an effect that commercial banks will possess the necessary ingredients to achieve the targeted cost, In addition to the absence of obstaclesfacing commercial banks in Karak Governorate when applying the targeted cost.Based on the results of the study, several recommendations were presented, including: Working to improve the bank's internal system to make it more convenient to manage costs, and encourage the bank’s management to hold special workshops to familiarize employees with the                     importance of the targeted cost, Moreover, the bank must determine the form of the service and its technical characteristics from the beginning, on specific and clear grounds.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "2",
            "month": "December",
            "year": "2020"
        },
    {
            "title": "Inter – Governmental Fiscal Relations and Issues of Economic Development in Nigeria: The Way Forward",
            "author": "Sani Alfred Ilemona, Nweze Augustine U",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(2), pp. 17-23",
            "doi": "10.15640/ijat.v8n2a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n2a3",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "2",
            "month": "December",
            "year": "2020"
        },
    {
            "title": "Implementing the New Revenue Standard for Construction Entities",
            "author": "Wing W. Poon",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(1), pp. 1-6",
            "doi": "10.15640/ijat.v8n1a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n1a1",
            "abstract": "The Financial Accounting Standards Board and the International Accounting Standards Board in 2014 jointly issued significantly revised standard on revenue recognition. The new standard became effective for annual reporting periods beginning after December 15, 2017, including interim reporting periods within that reporting period with a one-year deferral for nonpublic entities. The new standard provides a single comprehensive principle-based revenue recognition model to be applied across industries and jurisdictions. It replaces the detailed and often disparate industry-specific guidance existed under U.S. accounting standards. The focus of this paper is to examine the implementation of the new revenue standard for construction entities. Issues related to the pattern of revenue recognition, combining contracts and contract modifications are examined. In general, the fundamental accounting for long-term construction contracts does not change significantly by the new standard.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "1",
            "month": "June",
            "year": "2020"
        },
    {
            "title": "The influence of Tax Aggressiveness and Managerial Ownership to the Firm Value",
            "author": "Muhammad Yusuf, Etty Murwaningsari, Khomsiyah",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(1), pp. 7-19",
            "doi": "10.15640/ijat.v8n1a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n1a2",
            "abstract": "The research aims to analyze and obtain empirical evidence about the influence of tax aggressiveness. and managerial ownership to the Firm Value The independent variables used are tax aggressiveness. and Managerial Ownership. The dependent variable used is the Firm Value. The control variable Firm Size. The research population was a companies listed in Bursa Efek Indonesia (BEI) during 2012-2016 period. Sample was collected by purposive sampling method. Total 55 data companies were taken as study’s sample. Analysis method of this research used was multiple regression analysis. The result of this research showed that Firm Value didn’t affect to of tax aggressiveness listed on Bursa Efek Indonesia (BEI), while Managerial Ownership affect to of tax aggressiveness listed on Bursa Efek Indonesia (BEI).",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "1",
            "month": "June",
            "year": "2020"
        },
    {
            "title": "Granger Causality Effect of Taxation on Economic Growth in Nigeria",
            "author": "Adeniran, Busari G, Uguru, Leonard C.",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(1), pp. 20-26",
            "doi": "10.15640/ijat.v8n1a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n1a3",
            "abstract": "This study examines the extent to which revenue from taxation has improved the growth of Nigerian economy. An Ordinary Least Square (OLS) model was specified where Company Income Tax (CIT), Petroleum Profit Tax (PPT) and Value Added Tax (VAT) are employed as pre-determined variables for economic growth measured by Real Gross Domestic Product (RGDP). Prior to model fitting, Jarque-Bera test for normality revealed that all variables employed showed normality and therefore suitable for the specified function. However, a logarithmic transformation was required to reduce levels of variability among the observed variables. Different model‟s validity checks such as Coefficient of determination (R2), Multiple Correlation Coefficient(r), Durbin-Watson, Akaike info Criterion (AIC), Bayesian Information Criterion (BIC) and F-statistic were used to validate the model. Hypotheses were formulated and tested using statistical tools to validate theoretical backgrounds on economic growth as it is influenc                     ed by taxation. The results indicated that taxation had impacted positively on the growth of Nigerian economy and the study therefore recommended that VAT and CIT collections should be further encouraged and developed while more political efforts should be made towards ensuring stable business environments in the oil producing areas of the nation to improved collection of PPT.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "1",
            "month": "June",
            "year": "2020"
        },
    {
            "title": "Analysis of The Imposition Value Added Tax (VAT) on Down Payment of Property Developer Business in Indonesia",
            "author": "Rinaldi, Ismet Ismatullah",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(1), pp. 27-33",
            "doi": "10.15640/ijat.v8n1a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n1a4",
            "abstract": "The aim of this research is to analyze the extent role of the Value Added Tax (VAT) Regulation Article 4 Act 1 paragraph a, in handling activities of property developer business. In Value Added Tax (VAT) Regulation Article 4 Act 1 paragraph a, it stated that Taxable Goods submission in the customs area is an object of Value Added Tax (VAT). This research also analyzes Value Added Tax imposition in accordance with down payment paid by consumers to the company while the house conveyance has not been done. The process of housing conveyance takes a lot of time and during the process there will be uncertainties and possibilities that make the transaction failed. Several factors caused the transaction failed, it can be from the consumer side, the company side as the seller, or it can be from the bank as the third party which facilitated the Home Ownership Loan. Based on that condition, property developer business should impose a value-added tax on consumers when the building as taxable good is                      conveyanced to the consumer as a buyer.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "1",
            "month": "June",
            "year": "2020"
        },
    {
            "title": "Impact of State Government Revenues on Infrastructural Development in Bauchi State Nigeria",
            "author": "Aminu Hammayo, Dr. Isah Shittu, Dr. Aliyu A. Abdullahi",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(1), pp. 27-33",
            "doi": "10.15640/ijat.v8n1a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n1a5",
            "abstract": "The study examines the impact made by the efforts of Bauchi State Government in the development of infrastructure represented by the level of capital expenditure incurred through the utilization of the state’s revenues. Secondary data was obtained from the government’s Annual Financial Statements for the period 2006 to 2018. Ordinary Least Square regression was employed as the technique of analysis. The findings of the study revealed that share of allocation received from the federation account as well as debt both had a positive and significant influence in the provision of infrastructure while internally generated revenue, showed a negative and significant relationship. Other receipts comprising of contributions from Local Governments for the execution of joint projects as well as local and foreign grants and assistance received indicated a positive but insignificant relationship. The study recommends that policy makers should ensure a reasonable allocation of federation account revenue                     s towards capital projects implementation. Efforts at the mobilization of internally generated revenue and grants should be intensified with funds realized used along with funding drawn from the Local Governments as well as proceeds of debts raised towards the provision of the infrastructural needs of the state.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "1",
            "month": "June",
            "year": "2020"
        },
    {
            "title": "The Audit Investigation and Accounting Forensicin Detecting Fraud in Digital Environment",
            "author": "Prastika Suwandi Tjeng, Rina Nopianti",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(1), pp. 44-54",
            "doi": "10.15640/ijat.v8n1a6",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n1a6",
            "abstract": "A forensic accountant helps organizations or individuals primarily to provide management support in the form of reports to detect fraud and support litigation, primarily through expert witness testimony. The objectives to be achieved in this study are to explore how investigative and forensic accounting audits are applied in detecting fraud in the digital environment and to find out why investigative audits and forensic accounting in detecting fraud in the digital environment need to be applied. Researchers conducted a library study by collecting several economic journals and books relating to the problem under study. The data collection method in this research is done by interpreting and analyzing qualitative data. The results of this study indicate that forensic accounting in detecting fraud in the digital environment can be done by computer forensic and investigations that must be done by making copies of the entire log data, making fingerprints from numerical data, making fingerprints                     from copies, making master list hashes and documenting data that has been done.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "1",
            "month": "June",
            "year": "2020"
        },
    {
            "title": "The Model of Stock Market Participation with an Emphasis on Cultural and Social Factors: A Grounded Theory Approach",
            "author": "Sadegh Rahimi, Khosro Faghani makarani, Ali Zabihi",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "8(1), pp. 55-69",
            "doi": "10.15640/ijat.v8n1a7",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v8n1a7",
            "abstract": "The purpose of this study was to present a model of stock market participation with an emphasis on cultural and social factors. Given that to date, there has not been any realized stock market participation model developed with social and culture considerations; therefore, there are no realized cases to be studied as a part of this paper‟s research methodology. hence grounded theory is applied to propose a consistent framework. The results of the study showed that the cultural and social factors play an important role in stock market participation. factors like power distance index, uncertainty avoidance index, individualism vs. Collectivism, risk aversion, belief and attitude, self confidence, optimism, social interaction, group membership, family, peer group, internet, learning from others, word of mouth communication with others and herding behavior. The results also showed that expanding financial literacy, increase the transparency of financial markets, government protection of share                     holders, increase public awareness about the stock market, reduce entry and transaction costs in the stock market, are the most important strategies, which can be employed to increase stock market participation. This paper also discusses the applicability and implications of this new framework for future research.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "8",
            "issue": "1",
            "month": "June",
            "year": "2020"
        },
    {
            "title": "Accounting for Investment Property: Determinants of Accounting Policy Choice by Portuguese Listed Firms",
            "author": "Sandra Alves",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "7(2), pp. 1-10",
            "doi": "10.15640/ijat.v7n2a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v7n2a1",
            "abstract": "This study examines the determinants of accounting choices for investment property by Portuguese listed firms within the framework of Positive Accounting Theory. The results support the debt hypothesis under the Positive Accounting Theory, where high leverage firms significantly increase the probability the firms to choose the fair value model. The outcome also suggests that size and information asymmetry significantly increase the probability the firms to choose the fair value model, whereas ownership concentration significantly increase the probability the firms to choose the cost model. Overall this study suggests that the decision to use the fair value method seems to be guided mainly by the need to signal the firm’s financial health, especially its additional borrowing capacity, and to reduce information asymmetry between the company and outside investors. However, the equity/bonus plan and the number of non-executive directors on the board do not seem to matter.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "7",
            "issue": "2",
            "month": "December",
            "year": "2019"
        },
    {
            "title": "Sanctity of the Accounting Theory: The Application of Theory in the Conceptual Framework of Financial Statements and Accounting Standards",
            "author": "Uche Toby Agburuga",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "7(2), pp. 11-19",
            "doi": "10.15640/ijat.v7n2a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v7n2a2",
            "abstract": "This paper challenges the notion that there are no deliberate systematic and logical theories of accounting and advances the duality theory of accounting inherent in the accounting equation as the basic accounting theory that provides the unifying taxonomy for the fundamental going concern theory and the other accounting theories applied in the conceptual framework of financial statements and accounting standards. The paper adopts the conceptual approach to show that the logical reasoning and meanings, inherent in the concepts and conventions that characterize the system of recording and analysis of accounting information, are governed by the duality theory embedded in the accounting equation.The paper shows that the accounting theory underlie the fundamental assumptions, principles, and conventions and that the conceptual framework of accounting and the standards are guided by several derivative theories such as the going concern theory, the capital maintenance theory, the revenue realiz                     ation theory, the conservatism theory, and fair value theory.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "7",
            "issue": "2",
            "month": "December",
            "year": "2019"
        },
    {
            "title": "Career Choice as a Public Accountant in Accounting Students in the City of Semarang Indonesia: Aspects that are Considered",
            "author": "Bambang Jatmiko, Zaky Machmuddah, Amaliya Suryani, Suhana, Titi Laras",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "7(1), pp. 20-26",
            "doi": "10.15640/ijat.v7n2a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v7n2a3",
            "abstract": "This study aims to empirically prove aspects that are considered by students of accounting studies to pursue a career as public accountants, these aspects include financial rewards, labor market considerations, professional training, work environments, professional recognition, and social values. The population in this study were students of Accounting in the city of Semarang. Sample selection using a random method, 260 respondents were obtained to be respondents in this study. Data analysis techniques in this study using Structural equation modeling (SEM) with Warp PLS 4.0. The test results prove that labor market considerations, professional training, work environment, and social value variables have significant effects on career interests as public accountants. However, financial reward and professional recognition variables have no effect on career interests as public accountants. The implication of this research is the importance of the role of lecturers to conduct activities that su                     pport students having a positive perception about the public accountants profession. In addition, the accounting study program can invite professional public accountants to interact with students so that it will give them broad insights about the public accountants profession as well as to encourage and motivate them by providing real-life examples and success stories of public accountants careers. So that a positive image about public accountants to the public will be created.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "7",
            "issue": "2",
            "month": "December",
            "year": "2019"
        },
    {
            "title": "Derivatives and Hedging: Topic 815",
            "author": "Marietta Poshi",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "7(1), pp. 1-14",
            "doi": "10.15640/ijat.v7n1a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v7n1a1",
            "abstract": "Derivatives have been around for thousands of years. They are the instruments that are attributed to trade development around the world. What was initiated as a promise in trade to payback, has evolved into global trade with exclusive contracts that are enforceable in a court of law. Derivatives have emerged as an investing tool in the financial world even more aggressively the past 25 years. The banks and bankers are seen as the fundamental players of derivatives and hedging. While derivatives have some positive aspects to them, they get a lot of negative feedback due to their risky nature. The impact of the financial crisis in 2008 was felt around the world and derivatives were at the center of it. One consensus reached across all involved parties was that in order to avoid what could be a very impactful crash in the future of the financial world, there is a need for stricter and internationally imposed regulations. Too many regulations inhibit the financial environment and hinder its a                     bility to expand. On the other hand, loose regulations are left up for interpretation and have been abused in the past for financial gain while the actions taken as a result have impact the economy of the world. It is essential to find the right balance of regulations where financial institutions are held responsible for their actions but also allow the ability to participate freely in trade as this is essential for business continuity, growth, and expansions. One way to achieve this, is to have an established benchmark rate for trading across the world and that has been a challenge which has been argued back and forth for quite some time. Derivatives and hedging attempt to balance the risk involved with investments that are not regulated by the SEC. The return on investments is usually large as is the risk involved with them. The LIBOR has gotten a lot of attention in regards to being the optimal benchmark rate or not this past decade. This research paper, through the support of current                      literature and information collected from surveys supports the options for the optimal benchmark rate for hedge accounting purposes. From the responses collected from the survey and findings in current literature and publications there is evidence that there should be more than 2 benchmark rates used in derivatives and hedging. Interest rates should always be disclosed in financial statement and changes in rates should also indicate how they impact prior financial reports.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "7",
            "issue": "1",
            "month": "June",
            "year": "2019"
        },
    {
            "title": "Auditor Independence: A Qualitative Study of the Perceptions of Auditors",
            "author": "Inês Sofia Sousa Marques, Maria João Major, Maria Do Rosário Da Veiga",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "7(1), pp. 15-25",
            "doi": "10.15640/ijat.v7n1a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v7n1a2",
            "abstract": "The trustworthiness of a financial audit report rests on the perception of auditor independence. However, several factors can affect those perceptions, ultimately affecting market confidence. This study aims at providing a deep understanding of auditors‟ perceptions of auditor independence, particularly analysing whether and how their perceptions are affected either by the provision of non-audit services, competition, the size and tenure of the audit firm or the client‟s financial condition. Qualitative research was held through semi-structured interviews. Both the provision of non-audit services and tenure have generated great consensus amongst interviewees as impacting auditor independence. Rotation and litigation exposure were mainly perceived as enhancement factors.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "7",
            "issue": "1",
            "month": "June",
            "year": "2019"
        },
    {
            "title": "The Asymmetrical Cost Behavior: Cost Stickiness in Indonesian Listed Manufacturing Companies",
            "author": "Emillio Antonelli Soenjoto, Alfiandri",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "7(1), pp. 26-34",
            "doi": "10.15640/ijat.v7n1a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v7n1a3",
            "abstract": "The asymmetrical behavior of cost or sticky cost is a condition, where costs increase more when the activity rises compared to the decrease when the activity falls. This research applies the study of Ratnawati& Nugrahanti (2015) by using the phenomenal framework of sticky cost from Anderson, Banker, & Janakiraman (2003) against the previous inconsistent results in Indonesian listed manufacturing companies. This research uses five years period from 2011-2015 withfifty three Indonesian listed manufacturing companies. The study use net sales revenue and asset intensity to capture the stickiness of period costs, namely selling, general, and administrative costs (SG&A) and product costs, namely cost of goods sold (COGS).The measurement of the study used in log linear panel data regression analysis. The result shows that the stickiness of selling, general, and administrative costs (SG&A) cannot be proven in overall, cost of goods sold (COGS) is found to behave anti-sticky, and asset intensity h                     as no significant effect towards the degree of costs stickiness.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "7",
            "issue": "1",
            "month": "June",
            "year": "2019"
        },
    {
            "title": "The Role of Corporate Residence in Tax Matters and its Relationship with the Provision of Dividend Relief: A Comparative Analysis between the UK and the US Tax Systems",
            "author": "Amedeo Rizzo",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "7(1), pp. 35-39",
            "doi": "10.15640/ijat.v7n1a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v7n1a4",
            "abstract": "The aim of this paper is to illustrate the main features and issues related to the concept of corporate residence, showing to what extent it can have an impact on the provision of dividend relief. To this purpose, I will use the examples of the UK and the US, analysing the concept of residence and explaining why some emerging tax theories are trying to abandon it. Then, I will study the relevant connection between the concept of corporate residence and the provision of dividend relief. Residence is related to the elements of the legal autonomy of corporations. However, this separation of corporations from their shareholders is the main cause for economic double taxation and for other distortions related to corporate income taxes that need to be solved by dividend relief. Abandoning the concept of residence and attributing the corporate profit directly to shareholders would make the use of dividend relief unnecessary. Therefore, the advantage of relating the corporation to the place in whi                     ch taxes can be enforced is obtained at the cost of the distortions created by corporate taxation and the dividend relief systems.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "7",
            "issue": "1",
            "month": "June",
            "year": "2019"
        },
    {
            "title": "The Extent of Compliancewith International Accountingstandard (IAS) 41: The Case of SelectedAgri-tourismSites in Bohol, Philippines",
            "author": "Leomar B. Virador",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "7(1), pp. 40-45",
            "doi": "10.15640/ijat.v7n1a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v7n1a5",
            "abstract": "International Accounting Standard (IAS) 41 sets out the accounting provisions on the recognition, measurement, and required disclosures of biological assets (living plants and animals) in the financial statements. Adhering to the said standard makes the businesses’ financial statements fairly stated. Thus, this study aimed to determine the extent of compliance with IAS 41 of the selected agri-tourism sites in Bohol. The study used a descriptive research design. Primary data was obtained using a researcher-made survey questionnaire and through personal interview. Three agri-tourism sites participated in the study. The accountant or equivalent was interviewed for each site. Findings revealed that the compliance level of selected agri-tourism sites in Bohol with IAS 41 is high in terms of recognition of gains and losses in the financial statements; low in the recognition of biological assets in the financial statements, and disclosure requirements; and non-compliant in the measurement of bio                     logical assets, and recognition of government grants in the financial statements. The reason for not complying is that they are not knowledgeable and not aware of the standard. It is recommended that the respondents will attend training and workshops on how to apply IAS 41 to improve the level of compliance with the provisions of IAS 41.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "7",
            "issue": "1",
            "month": "June",
            "year": "2019"
        },
    {
            "title": "An Analysis of Generational and Job Rank Determinants of Accountants’ Work Styles",
            "author": "Emily Littlefield, PhD; Robert D. Waldo, DBA",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(2), pp. 1-13",
            "doi": "10.15640/ijat.v6n2a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n2a1",
            "abstract": "Because the recruitment and retention of qualified certified public accountants (CPAs) is vital to an organization’s fiscal management and success, it is critical that businesses attract and hire accounting professionals whose work styles align with the skills demanded of the profession. When seeking to fill positions for professionals in high demand occupations with high turnover rates, such as CPAs, finding accountants whose work styles are congruent with positions’ work and skill competencies is critical.The problem to be addressed in this study is that organizations need to hire and retain CPAs who possess the work style dimensions that contribute to organizational success, work style dimensions of CPAs are unknown, and organizations need tools to assess CPAs’ work style dimensions. Therefore, it is important to assess the CPAs’ work style dimensions.The purpose of this quantitative study was to assess the extent to which, if any, CPAs’work style dimensions differ according to generat                     ion and job rank as measured by the Leading Dimensions Profile (LDP).",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "2",
            "month": "December",
            "year": "2018"
        },
    {
            "title": "Evolution of the Internal Audit Function in the Management of Transfer Pricing",
            "author": "Pietro PAVONE, Clizia DI NUNZIO",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(2), pp. 14-22",
            "doi": "10.15640/ijat.v6n2a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n2a2",
            "abstract": "This study focuses on the management of tax risk in intercompany transactions.Transfer pricing assumes there is an intimate relationship between business factors and tax factors, thus administrative and tax obligations must be aligned with the company's strategic variables.In this context, the need to build and represent a transfer pricing risk assessment model is a priority in order to check that intragroup flows comply with the tax regulations of the various countries the companies involved in the transactions are located, thus ensuring the desired transfer pricing scheme fully complies with the legislator’s intent. To this end, this paper highlights the importance of the audit function in company groups operating on the international stage and aims to trace the desirable future prospects towards which the internal auditing activities should be directed in order to support group tax dynamics, so that there is a balance between the need to protect tax interests and, at the same time, the                      need for taxation not to become an obstacle to transnational trade and investment.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "2",
            "month": "December",
            "year": "2018"
        },
    {
            "title": "The Implementation of Accounting Standards for Agriculture (Psak 69): The Analysis of Companies’ Readiness",
            "author": "Yosefa Sayekti, Ririn Irmadariyani, Aisa Tri Agustini, Djoko Supatmoko",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(2), pp. 23-28",
            "doi": "10.15640/ijat.v6n2a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n2a3",
            "abstract": "The objective of this research is to analyze the readiness of Accounting Standards for Agriculture (PSAK 69) that should be implemented for 2018 financial statements in Agro Industry Company in Jember and Probolinggo, Indonesia. Qualitative Method has been employed in this research with interview and observation in some agro industry companies. The objects of this research are PT Mangli Djaya Raya, PTPN X (Kertosari Garden), and Perum Perhutani KPH Jember and Probolinggo. The results indicate that those companies are not entirely implementing PSAK 69 and generally they employ historical cost to recognise and measure their biological assets. PT Mangli Djaya Raya, which has tobacco plants, reports its financial statements once a year, while the lifetime of tobacco plants last less than a period of financial statements. Therefore, the tobacco plants doesn‟t appear in their balance sheet as biological assets. The results in PTPN X, which has tobacco, cacao, and sugarcane, imply that the biolo                     gical assets recognition based on historical cost rather than fair value. However, for cacao and sugarcane have already been recognized as biological assets in its balance sheets. Similar results for Perum Perhutani KPH Jember and Probolinggo, which have teak, rosewood, and mahogany as their commodity, do not recognize biological assets based on fair value. Generally, the obstacle of PSAK 69 implementation is how to measure biological assets using fair value due to lack of active market. This may affect reliability and relevancy of companies financial statements information regarding biological assets.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "2",
            "month": "December",
            "year": "2018"
        },
    {
            "title": "Measuring Tax Compliance among Small and Medium Enterprises in Nigeria",
            "author": "Dr. Olufemi Aladejebi",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(2), pp. 29-40",
            "doi": "10.15640/ijat.v6n2a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n2a4",
            "abstract": "This study examined the level of tax compliance among owners of small and medium enterprises (SMEs) in Nigeria. Small business is vital to the economy of Nigeria. The sample size for the research was 250 and 223 SME owners responded through the questionnaire distributed. The quantitative method was used in analyzing the data collected. SPSS was used to analyze the data. Findings showed that female SME owners are more tax compliant than male counterparts. There is a need for tax education among SME owners. There is multiple taxations. Tax amnesty can increase the level of tax compliance.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "2",
            "month": "December",
            "year": "2018"
        },
    {
            "title": "The Impact of Country-Level and Firm-Level on Financial Performance: A Multilevel Approach",
            "author": "Wafaa Salah",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(2), pp. 41-53",
            "doi": "10.15640/ijat.v6n2a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n2a5",
            "abstract": "The objective of this study is to demonstrate the relative importance of both firm-level and country-level on financial performance. In addition, to explore the influence of firm-level variables (Accounting standards, firm age, firm size, liquidity) together with country-level variables (GDP per capita, inflation rate, development status, human development index, country openness to trade) on financial performance. Financial performance is measured in this study by Return on Assets. Hierarchical Linear Modeling is employed to identify the components of firm performance variability. This study employs a sample of 4095 publicly listed industrial firms from 54 countries listed on stock exchange covering the period from 2014 to 2016.The results show that both firmand country-level performance variations are significant. However, financial performance is explained better by firm-level performance variation that contributes up to 92.8% to variance in financial performance.Moreover, in terms of                      country-level variables, the results show that country openness to trade and human development indexare significantly affecting firm performance. Moreover, in term of firm-level variables, the results show that firm age is negatively related to firm financial performance and firms adopting IFRS are more likely to have higher financial performance than firms adopting local GAAP.This study contributes to the literature by employing Hierarchical Linear Modeling to integrate both firm-level and country-levelvariables into one cross-sectional analysis. It provides an insight to analysts and stakeholders to consider multi-level characteristics when examining financial performance.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "2",
            "month": "December",
            "year": "2018"
        },
    {
            "title": "The Impact of Taxes on Foreign Direct Investments",
            "author": "Dr. James N. Mohs, Robert Wnek JD, LLM, CPA; Arthur Galloway MST, MSA(C)",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(2), pp. 54-63",
            "doi": "10.15640/ijat.v6n2a6",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n2a6",
            "abstract": "The role of taxation in the area of foreign direct investment and economic growth has been the topic of many studies. With the effect of newly enacted corporate tax reform in the United States the impact will become the topic of many future studies. This paper will review the common factors used to correlate the impact of corporate taxation on Foreign Direct Investment decision making. The purpose of this research is to review and outline the sensitivity to taxation based on a multiplicity of economic factors that will include taxation on the return on investment and global profits. For the purposes of this research only indirect taxes haven been considered. The conclusions, recommendations and implications reached in this study are generalizable and appropriate for use in developing best practice solutions.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "2",
            "month": "December",
            "year": "2018"
        },
    {
            "title": "Impact of Internal Control Components and Effectiveness of Internal Control System with the Moderating Effect of Corporate Governance of Peoples’ Bank in Sri Lanka",
            "author": "C.T. GamageLow, Lock Teng Keving",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(2), pp. 64-71",
            "doi": "10.15640/ijat.v6n2a7",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n2a7",
            "abstract": "Purpose of this study is to examine the impact of internal control components and effectiveness of internal control system with the moderating effect of corporate governance of Peoples’ Bank in Sri Lanka. There are five independent variables namely Control environment, Risk assessment, Control activities, Information & communication system and Monitoring taken in to account, Corporate governance taken as moderating variable and dependent variable of this study is Effectiveness of internal control system. Data was gathered using the questionnaire which was administrated to bank branch managers occupied in Peoples Bank. 173 middle level bank branch managers’ participated in the study. The collected data analyzed by descriptive statistics and inferential statistics. The results presented that there are significant and positive relationship between the internal control components (such as control environment, risk assessment, control activities, information and communication system and monito                     ring) and effectiveness of internal control system andmean time corporate governance moderates the relationship between internal control mechanisms and usefulness of internal control system. Itcan be concluded that Peoples Bank management has recognized and practiced the sound internal control system and existing corporate governance for strengthen the system too.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "2",
            "month": "December",
            "year": "2018"
        },
    {
            "title": "Effects of the Spanish Accounting Reform on the Economic and Financial Structure, and the Performance of Listed Companies",
            "author": "Juan L. Gandía, David Huguet",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 1-17",
            "doi": "10.15640/ijat.v6n1a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a1",
            "abstract": "The aim of this paper is to examine the impact of the 2008 accounting reform on the economic and financial indicators which are commonly used in the financial analysis, as well as analyse whether there is an evolution on these measures as a consequence of a learning process or an adaptation to the accounting reform. Firstly, we do a normative analysis to examine the differences in the Spanish GAAP before and after the accounting reform. Based on the differences we find, we formulate a series of hypotheses about how these differences affect the main measures of economic structure, financial structure, and performance which are commonly used in the analysis of financial statements, as well as their effect on the accruals. These hypotheses are tested with a multivariate analysis in a sample of listed companies. Results show that the accounting reform has effects on the financial indicators.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    {
            "title": "Abolition of Statutory Audit Obligation of Small Limited Liability Companies in Norway.Should Tax Evasion Inclined Industries be Excepted?",
            "author": "Even Fallan, Stein Antonsen, Lars Fallan, Tor-Eirik Olsen",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 18-30",
            "doi": "10.15640/ijat.v6n1a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a2",
            "abstract": "All over Europe, mandatory audit requirements have been repealed forsmall- and medium-sized enterprises (SMEs). Audit exemption was introduced for small enterprises in Norway in 2011. This option was justified by benefits of reduced costs and bureaucracy for small companies. On the other side, weakened reliability of financial statements and tax returns may increase the extent of tax evasion. This study of 163 769 Norwegian companies reveals that small companies in tax evasion inclined industries opt-out auditors to a significantly greater extent than companies in other industries. The results highlight the concern that the abolition of auditing obligations impair the reliability of tax accounts and lead to increased tax evasion. Several explanations for the result are discussed, including asymmetric information and opportunism and demand side issues within the Allingham and Sandmo (1972) framework for explaining tax evasion. The results may also be due to supply side factors such as the                      fact that companies in evasion inclined industries are likely to pay higher audit fees than companies in other industries. The increased information asymmetry actualises the questionofwhether the tax authority's control capacity should be strengthened or whether audit exemptionsshould be limited in evasion inclined industries.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    {
            "title": "Choix Fiscaux ET Contraintes Financieres Des Entreprises: Une Lecture À Partir Du Modèle D’incitation Camerounais",
            "author": "Aboubakar MFOPAIN",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 31-41",
            "doi": "10.15640/ijat.v6n1a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a3",
            "abstract": "Taxation choices made by enterprises are not neutral. The study carried out shows that taxation choices and the respect of commitments which are all attached to it depend on the adjustment of financial constraints in which they are often faced with on the one hand, and their financial situation at a time when the choice is being made on the other hand. Also, enterprises that respect such commitments are mostly characterized by their financial situation than the mastery of financial constraints which are imposed to them. However, those who do not respect it look for more ways of taking advantage on the cost of financing through the means of financial liver effect.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    {
            "title": "Executive Compensation and Corporate Income Tax: A Question of Societal Equity",
            "author": "Michel Coulmont, Sylvie Berthelot, Catherine Gagné",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 42-51",
            "doi": "10.15640/ijat.v6n1a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a4",
            "abstract": "From the perspective of corporate social responsibility, which is intended to promote ethical and socially responsible behaviour by organisations, little research has focused on the tax avoidance that impedes governments’ capacity to provide education, healthcare, security and infrastructures for managing environmental issues. Inspired by the 2014 American report, Fleecing Uncle Sam, this paper compares the compensation of CEOs of firms listed on the S&P/TSX Composite Index and the amount of corporate income tax these firms pay.The analysis findings show that more than 40 of the 203 sampled firms between 2013 and 2015 paid less in income tax than in CEO compensation. Nearly 70% of these firms paid no taxes or received a refund, while only a minority of them reported a net loss. Tax cuts and other generous corporate tax measures do not seem to have had the expected effect. The results of this study show that in paying little income tax, each year, firms spent less on contributing to the gr                     owth of the economy that supports them than they spent on compensating their CEO. This situation should be documented. Are these practices acceptable from a societal perspective?",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    {
            "title": "Investigation of the Effect of Earnings Management on Stock Liquidity for the Case of the Tunisian Stock Exchange",
            "author": "Sonia SAYARI",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 52-73",
            "doi": "10.15640/ijat.v6n1a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a5",
            "abstract": "Earnings management has often been percieved as manipulating financial statements in view of mistaking stakeholders about the firm's economic performance or influencing contractual relationships founded on accounting figures. In this study, we examine the relationship between disclosed accounting information quality and stocks liquidity. To this end, we examine a sample of 220 observations of Tunisian listed companies over the 2007-2016 period. The results indicate that there is a negative relationship between accounting information quality measured by quality of accruals and stocks liquidity. Our study aimsat examining the Tunisian context and tries to determine the effect of earnings management on stocks liquidity.The relationship between liquidity(via the ask-bid spread) and accruals was examined, usingtwo modified earnings management measurementmodels: modified model of Jones (1995)and model of Kothariet al. (2005). Considering the discretionary component of accounting accruals in the                      relationship between a firm's stocks liquidity and its accruals is a new controversialtopic. Using a panel data qualitative approach, the obtained results point to a positive relationship between discretionary accruals and Tunisian firms'ask-bid spread (as estimated by the two measurement models). This indicates that discretionary accruals allow Tunisian investors to optimally construct their stocksportfolios. The collected results also highlighted a negative and a significant impact of transaction size and volume on firms’ask-bid spread. Indeed, earnings management allows for increasingstocks uidity when discretionary accruals are negative and reducingtheir liquidity when these accruals are positive. This is confirmed by the two discretionary accrualsmodels.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    {
            "title": "The Credit Quality and the Market- Based Performance of Banks: A Comparative Study",
            "author": "Dr. Salah Ahmed ORABY",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 74-81",
            "doi": "10.15640/ijat.v6n1a6",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a6",
            "abstract": "This research aims at measuring the relationship between the credit quality measured by both non-performing loans % (NPL) and provisions for loan losses%(PLL) as independent variables and the market performance of banks measured by share prices.The sample study includes 11 Saudi listed banks in Saudi stock exchange and 15 banks listed in Jordanian stock from 2011 to 2016. This study used regression analysis and correlation analysis to analyze the quarterly data to test research hypotheses.Results of the Saudi case indicated that neither NPL% nor PLL has a statistically significant relationship with share prices and that can be interpret that investor in Saudi Arabia ignore both NPL and PLL when pricing shares of banks. On the other hand, results of the Jordanian case indicated that only PLLhave a statistically positive impact on share prices of banks.so it can be said that investors in Jordanian capital market look at part of provisions for PLL as a source of potential profit in future be                     cause they believe that PLL contain discretionary component used to manage earnings and used as signalingtool to shareholderson future expected cash flows. Also results indicated that both NPL and PLL are alternative measures should not be used together in the same model as predictors and PLL is better than NPL because PLL reflects both specific and general risk.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    {
            "title": "Accounting for NGOs, Compliances and Deviations",
            "author": "Dr. P. Laxmikantham",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 82-91",
            "doi": "10.15640/ijat.v6n1a7",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a7",
            "abstract": "For ensuring true and fair view of the financial position of NGOs, there is a need of proper accounting. The NGOs in Ethiopia are lacking standardized and harmonized accounting system. Some NGOs are to a large extent follow the GAAP as far as possible within the legal requirements. Over the years, the legal frame work in Ethiopia evolved through the provisions of Civil Code 1960 and the related proclamations, legal notices and the periodical rules and regulations, and the code of conduct issued by the RoA, the DPPC and the CRDA. All these regulations are meant to ensure true and fair view of the financial position. Apart from these legal aspects, there are a few external reporting stipulations that are applicable to the NGOs. They are given by the FASB since 1983 and over the years they are reviewed and revised. To ensure full disclosure of the financial operations and also to be highly transparent, the FASB suggests to follow the Accounting Standards No. 93 & 99, 116, 117, 124 and 136 th                     at are directly applicable to NGOs. A field investigation as to the compliance of the NGOs of Ethiopia with the GAAP locally enforced legal stipulations and the FASB Standards reveals that there are many deviations. The nomenclature of the Statement of Activities as adopted by the NGOs are varied and rarely uniform. Further, the field investigation reveals that out of 31 NGOs only 12 prepare Balance Sheets and even the balance sheets prepared by them are not containing the vital information about depreciation in case of 4 NGOs. With regard to the Statement of Cash Flows (FASB Standard No.117) none of the 31 NGOs prepare them. Thus, the field survey reveals that there are significant deviations when compared with the accounting standards resulting a poor disclosure and transparency. To ensure fair disclosure with in the framework of FASB Standards, local accounting requirements in line with the Civil Code, and the regulations of DPPC, there is a need to develop an internationally oriented                      and locally developed accounting principles and an appropriate package of three Annual Financial Statements for the NGOs in Ethiopia.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    {
            "title": "An Empirical Investigation into the Pricing of Audit Services in Bahraini Listed Companies",
            "author": "Hussein Khasharmeh",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 92-101",
            "doi": "10.15640/ijat.v6n1a8",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a8",
            "abstract": "The current study aimed to investigate the factors influencing the pricing of audit services from the viewpoints of financial managers, accountants, and internal auditors who are working in listed companies in Bahrain. To achieve this aim, a questionnaire was used in the study. In addition to descriptive statistics, non-parametric tests such as the Chi-square Test were used. The results of descriptive analysis showed that all of the questions (1-33) in all groups prove to be important factors that affect pricing of audit services in Bahraini listed companies with the average means ranging from 3.43 to 4.5 and standard deviations ranging from 0.47434 to 0.63851. The results of the Chi-square test confirmed the results of descriptive statistics that all questions were significant for the seven groups (p < 0.05) indicating that respondents‟ answers for each question were not equally distributed among the different levels of agreement on determinants of auditor‟s fees in listed companies in B                     ahrain in all groups. Thus, the respondents‟ answers were not equally distributed among the different levels of agreement on the factors affected pricing of audit services in Bahraini listed companies in all groups. Based on the results of the Chi-square Test, all of the hypotheses developed (H1 – H7) are accepted. The study recommended that future research is needed to investigate this issue in other developing countries in general and GCC countries in particular. The study also suggested that other respondent groups such as external auditors, shareholders, regulators and members of the audit committees might be included in future research.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    {
            "title": "International Financial Reporting Standards and Manufacturing Firms’ Financial Performance in Nigeria: A Study of Selected Quoted Firms",
            "author": "Leonard I. Amaefule Ph.D; Ulumma R. Onyekpere; Edith O. Kalu",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 102-114",
            "doi": "10.15640/ijat.v6n1a9",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a9",
            "abstract": "This study examined the effect of international financial reporting standards (IFRS) adoption on the financial performance of quoted manufacturing firms in Nigeria. It utilized data on two key financial performance indicators: earning per share (EPS) and return on assets (ROA) of five selected manufacturing firms quoted on the Nigeria Stock Exchange for the period of 2007 – 2016; segregated into pre-IFRS (NGAAP) regime and post-IFRS regime. Descriptive analysis (Mean) and inferential statistics (paired sample t-test) were employed in analyzing the data collected. Results from the analysis indicated that, on the one hand, IFRS adoption in Nigeria exerts insignificant negative effect on the firms’ EPS while on the other hand exerting significant negative effect on the firms’ ROA. The study thus concluded that manufacturing firms in Nigeria have not fared better with regards to their reported financial performance following the adoption of the new financial reporting standards. The study the                     refore recommended that the financial reporting council of Nigeria should consider a review of the tenets of IFRS as specified by the International Accounting Standard Board to incorporate local content; hence, instead of full adoption, convergence could be the way to go by Nigeria firms.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    {
            "title": "Moderating Effect of Political Risk on the Relationship between Bank Characteristics and Lending Rates among Commercial Banks in Kenya",
            "author": "Maubi Andrew Mokaya, Dr. Ambrose O. Jagongo, Dr. Rosemary M. James, Dr. Duncan O. Ouma",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "6(1), pp. 115-123",
            "doi": "10.15640/ijat.v6n1a10",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v6n1a10",
            "abstract": "Low lending rates would encourage increased uptake of loan facilities hence fostering investments that in turn would be expected to spur economic growth. Increase in investments is expected to yield good returns hence resulting in multiplier effects. After the 1990s when financial liberalization had taken root, commercial banks in Kenya stood related in terms of not only other aspects of their trading but also with lending rates. The benefits expected of Financial Liberalization and deepening of the financial sector is narrowing of lending rates. Political risk is the risk faced by commercial banks that include political decisions events conditions or pronouncements which significantly affect their commercial banks profitability. In this context, the effect on profitability would have an effect on lending rates in return. The Political risk index is computed based on twelve items entailing social and political constructs within a country. The study sought to establish the moderating effec                     t of political risk on the relationship between bank characteristics and lending rates among commercial banks in Kenya. The research philosophy for this research was positivism. Explanatory non-experimental research design was employed. The target population was thirty nine (39) commercial banks from whom secondary data was collected by way of census since these are the banks from which complete information could be obtained for meaningful analysis for the study period 2006-2015. Descriptive Statistics including Mean, Standard deviation, inferential statistics (Panel regression analysis and Correlation analysis) were carried out. Data analysis was run on the Stata 13 package and findings presented in figures, tables, graphs and charts while deriving conclusions and recommendations from the findings of the study. Political risk was found to have insignificant moderating effect on the relationship between bank characteristics and lending rates among commercial banks in Kenya.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "6",
            "issue": "1",
            "month": "June",
            "year": "2018"
        },
    
    {
            "title": "The Quality and Usability of US SEC XBRL Filings",
            "author": "Ariel Markelevich",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(2), pp. 1-17",
            "doi": "10.15640/ijat.v5n2a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n2a1",
            "abstract": "In 2009, the US Securities and Exchange Commission (SEC) required all public companies and mutual funds to report their financial information to the SEC using a markup language called eXtensible Business Reporting Language (XBRL). The purpose of this requirement was to improve the accessibility to financial accounting data, increase the information flow between companies and investors, and make it easier and cheaper to collect and analyze data. Some controversy exists whether the benefits from using XBRL based data outweigh the costs associated with the creation of data and the use of the data. As part of that discussion, some claimed that the XBRL filings are of low quality and are difficult to use. The purpose of this paper is to examine the quality and usability of XBRL filings by examining different filing characteristics and mistakes over time. The focus of this paper is on the following characteristics: the use of extended tags, Document and Entity Information (DEI) errors, scale er                     rors, and sign switches. Findings suggested that starting in 2012, there has been a steady improvement in the quality and usability of the XBRL filings in most aspects. Additionally, it seems that the lower quality and usability originates in data in the notes to the financial statements and in data filed by smaller companies. The results presented in the paper are consistent with the notion of companies moving along a learning curve and improving the quality and usability of the XBRL data as they gain more experience tagging. Theseimprovements make it easier to use the XBRL filings and reap the benefits offered by this data. However, in spite of the efforts and improvements, it seems like more work is needed to continue improving the quality of the data.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "2",
            "month": "December",
            "year": "2017"
        },
    {
            "title": "Surveys of Two Sections of a Cost Accounting Course to Determine Students’ Overall Experience Using an Online Homework System and Whether it Helped the Students Obtain a Better Understanding of the Topics Presented in the Course",
            "author": "Rosemarie Carroll",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(2), pp. 18-32",
            "doi": "10.15640/ijat.v5n2a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n2a2",
            "abstract": "This article presents the result of surveys that were administered to two sections of a cost accounting course. The purpose of the surveys was to determine students’ overall experience using an online homework system and whether it helped the students obtain a better understanding of the topics presented in the course. The two sections of the cost accounting course were taught by two different professors.Homework was part of the overall grade in day section while it was not in the evening section. Even though the sections were taught by different professors both followed the same syllabus. The survey questions were answered anonymously by the students. The evening class had a sample size of 23 students and the day class had a sample size of 23. In conclusion it appears that the students of the classes surveyed had a positive experience using the online homework system. It also appears that the use of the online homework was an effective tool in gaining a better understanding of the topics                    . An interesting result was that the students did not make use of the additional tools for example, multimedia library, which is included in the online homework system. It appears that the students believe that these tools have little or no effect on the time spent on their studies. This could serve as a basis for additional studies to find out why the students feel this way and see what can be done to introduce these tools to the students.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "2",
            "month": "December",
            "year": "2017"
        },
    {
            "title": "The Influence of Profitability, Leverage, Firm Size and Capital Intensity Towards Tax Avoidance",
            "author": "Dr. Bambang Setyobudi Irianto, Yudha Aryo Sudibyo, Abim Wafirli S.Ak",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(2), pp. 33-41",
            "doi": "10.15640/ijat.v5n2a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n2a3",
            "abstract": "This study aims to examine the factors that affect the company’s tax avoidance. There are several factors used include size, leverage, profitability, and capital intensity. The purpose of this study is to determine the influence of firm size, leverage, profitability and capital intensity ratio on tax avoidance in manufacture companies listed on the Indonesian Stock Exchange 2013-2015. Population taken as the object of observation amounted to 156 manufacturing companies listed in Indonesia Stock Exchange in the period 2013-2015. Determination of the sample was made by applying purposive sampling method and obtain a sample of 36 manufacturing companies based on certain criteria. The results showed that the size positive influence on the effective tax rate. While leverage, profitability and capital intensity ratio does not significantly influence the tax avoidance. In this study, there are still many limitations and shortcomings namely the effect of independent variables on the dependent var                     iable. Hence more independent variables are needed.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "2",
            "month": "December",
            "year": "2017"
        },
    {
            "title": "The Impact of Isak 29 on the Value Relevance of Accounting Information (Empirical Study on Mining Companies Listed on the Indonesia Stock Exchange 2013-2015) Elvian Galang Prabuwoso1, Bambang",
            "author": "Setyobudi Irianto, Laeli Budiarti",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(2), pp. 42-55",
            "doi": "10.15640/ijat.v5n2a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n2a34",
            "abstract": "The purpose of this study is to examine whether ISAK 29 has an impact on the value relevance of accounting information of mining companies listed on the Indonesia Stock Exchange. This study attempted to reveal market reaction to accounting standard policies changes, acertainaccounting numbers can reflect the information that investors use in assessing the value of corporate equity. Reduction phenomenon in market capitalization and stock index of mining sector coincided when ISAK 29 start to be effective, indicate the negative reaction to ISAK 29 implementation. This phenomenon is contrast with DSAK's goal of adopting IFRS, which is to improve the functioning of the global capital market by providing relevant, more comparable and high-quality information to investors. The population used in this study is mining company listed on the Indonesia Stock Exchange in 2013 and 2015. Total mining company listed on the Indonesia Stock Exchange is 41 companies. Sampling method to select the sample in                      this research is purposive sampling. The total sample of this study is 32 mining companies for each year in 2013 and 2015. This study used price test with valuation model, the results showed an increase in adjusted R2, indicate that the implementation of ISAK 29 in Indonesia has an effect of increasing the value relevance of accounting information. Therefore, there is an increase in the value relevance of accounting information of mining companies in Indonesia after implementation of ISAK 29. Chow test result showed that the F-stat value is greater than F-table, the test results indicate a structural changes of the valuation model that used to determine the value relevance of accounting information after the implementation of ISAK 29. In conclusion, implementation of ISAK 29 effected the structural changes in the form of value relevance differences.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "2",
            "month": "December",
            "year": "2017"
        },
    {
            "title": "The Effect of Consumption Taxes on Poverty and Income Inequality in Kenya",
            "author": "Anne Wanyagathi Maina",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(2), pp. 56-82",
            "doi": "10.15640/ijat.v5n2a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n2a5",
            "abstract": "The purpose of this study is to examine whether ISAK 29 has an impact on the value relevance of accounting information of mining companies listed on the Indonesia Stock Exchange. This study attempted to reveal market reaction to accounting standard policies changes, acertainaccounting numbers can reflect the information that investors use in assessing the value of corporate equity. Reduction phenomenon in market capitalization and stock index of mining sector coincided when ISAK 29 start to be effective, indicate the negative reaction to ISAK 29 implementation. This phenomenon is contrast with DSAK's goal of adopting IFRS, which is to improve the functioning of the global capital market by providing relevant, more comparable and high-quality information to investors. The population used in this study is mining company listed on the Indonesia Stock Exchange in 2013 and 2015. Total mining company listed on the Indonesia Stock Exchange is 41 companies. Sampling method to select the sample in                      this research is purposive sampling. The total sample of this study is 32 mining companies for each year in 2013 and 2015. This study used price test with valuation model, the results showed an increase in adjusted R2, indicate that the implementation of ISAK 29 in Indonesia has an effect of increasing the value relevance of accounting information. Therefore, there is an increase in the value relevance of accounting information of mining companies in Indonesia after implementation of ISAK 29. Chow test result showed that the F-stat value is greater than F-table, the test results indicate a structural changes of the valuation model that used to determine the value relevance of accounting information after the implementation of ISAK 29. In conclusion, implementation of ISAK 29 effected the structural changes in the form of value relevance differences.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "2",
            "month": "December",
            "year": "2017"
        },
    {
            "title": "Transfer Pricing Abuse: the Ghanaian Perspective and the Role of the Accountant in Tax Compliance",
            "author": "Emmanuel Budu Addo, Hussein Salia, Abdallah Ali-Nakyea",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(2), pp. 83-91",
            "doi": "10.15640/ijat.v5n2a6",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n2a6",
            "abstract": "Advancement in global technology and international trade has facilitated the development of complex business structures within many multinational enterprises (MNEs). Though establishing MNEs has been useful for the development of their host nations such as Ghana, most have adopted aggressive tax planning schemes that enable them to shift profits from one tax jurisdiction to another using Transfer Pricing to achieve their corporate profitability objective. Many nations have been deprived of their genuine tax revenue due to these practices. Governments of these affected nations have thus resorted to introducing measures that require the support of various professionals to ensure intra-company transactions are at arm‟s length. These measures are expected to help prevent mispricing of goods and services and to stop potential tax revenue losses to the states. This paper examines how transfer pricing abuse deprives countries like Ghana of huge tax revenues. It also outlines legislative measures                      introduced by the government to counteract aggressive tax avoidance schemes employed by the MNEs. It further identifies Chartered Accountants as principal stakeholders, who have roles to play in ensuring effective application of and strict adherence to anti-avoidance legislation in Ghana. The paper advocates for transparency of accounting transactions to enhance compliance with Transfer Pricing regulations.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "2",
            "month": "December",
            "year": "2017"
        },
    {
            "title": "Survey to Determine the Factors That Influence the Overall Satisfaction with Online Homework",
            "author": "Rosemarie Carroll",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(2), pp. 92-99",
            "doi": "10.15640/ijat.v5n2a7",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n2a7",
            "abstract": "A survey was administered to obtain feedback from students to determine factors such as age, G.P.A., amount of time spent on doing online homework that might influence the overall satisfaction with online homework. The survey was administered to students during the spring, 2017 semester taking principles of accounting course. The sample size of the data was 29 students. The students used a course management system to submit homework. The homework was algorithmic and graded. The course management system allowed the student to access a variety of tools to help with their understanding of the course materials. The tools included: demonstration problems and solution walkthrough videos. The class selected was an accounting principles hybrid course. The survey consisted of 17 questions that were filled out anonymously by the students. The following are the questions and the results obtained.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "2",
            "month": "December",
            "year": "2017"
        },
    {
            "title": "Is There Herding Bias in Tax Amnesy? The Indonesian Case",
            "author": "Ratna Yulianti, Emon Yoseph Ponco Ajie, Theresia Woro Damayanti",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(2), pp. 100-106",
            "doi": "10.15640/ijat.v5n2a8",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n2a8",
            "abstract": "Besides the effects of tax amnesty on tax compliance and tax revenue, taxpayers’ behavior in participating in tax amnesty is also an interesting research avenue. A likely phenomenon in the Indonesian tax amnesty program is herding bias. Accordingly, this research aims to identify herding behavior in tax amnesty. Using a survey method, we involve 291 taxpayer respondents in our study. Our findings suggest that most of the taxpayers do not show herding behavior, mainly because there is certainty about the tax amnesty program. Further investigation reveals that herding behavior is associated with tax form filling, tax amnesty calculation, and taxpayers’ age in participating tax amnesty.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "2",
            "month": "December",
            "year": "2017"
        },
    {
            "title": "A Descriptive Analysis of Coppin State VITA on the Baltimore Neighborhoods",
            "author": "Loretta Baryeh, Ph.D; Hyacinth Ezeka, CPA",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(1), pp. 1-11",
            "doi": "10.15640/ijat.v5n1a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n1a1",
            "abstract": "The study analyzed the Coppin State VITA (volunteer income tax assistance) and the related effects on the residents of the inner Baltimore City and the surrounding areas that used the services for tax preparation purposes for the 2013 to 2014 period. Coppin State VITA was run by accounting professors and students in the college of business in the Coppin State University. The study found that the majority of tax payers earned a refund. The average income of taxpayers was $22,000. The program was very beneficial to both the community and students of Coppin State University. Residents of the community benefitted from receiving professional tax preparation services from Coppin State VITA without having to pay. This saved the community thousands of dollars. The students benefited from preparing real taxes, whilst they were still students. Most students do not graduate with such an experience. The program fostered positive co-operation between the university and the community at large.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "1",
            "month": "June",
            "year": "2017"
        },
    {
            "title": "Base Erosion and Profit Shifting: Options, Opportunities and Alternatives",
            "author": "Dr. James N. Mohs; Martin A. Goldberg J.D, LL.M; David Palacio Buitrago MST",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(1), pp. 10-21",
            "doi": "10.15640/ijat.v5n1a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n1a2",
            "abstract": "Base erosion and profit shifting is generally defined as tax strategies that serve to exploit gaps or inconsistencies in global tax systems that allow an enterprise to shift profits to lower tax jurisdictions. This can be accomplished by either shifting income to lower tax jurisdiction or shifting deductible expenses to higher tax jurisdictions. Historically, these shifting strategies have been handled on a country by country basis with no centralized framework. In 2015 the Organization of Economic Cooperation and Development proposed modifications through its Base Erosion and Profit Shifting project that if adopted by the member countries, would reverse the adverse impact to the global tax system caused by shifting profits and assets among members of controlled groups. By reviewing the major tax shifting strategies as well as the Organization of Economic Cooperation and Development proposals to curb any perceived abuses, this research will serve to fill a gap in the literature surroundin                     g Base Erosion and Profit Shifting strategies. The conclusions and recommendations reached in the paper are generalizable and appropriate for use in developing best practice solutions.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "1",
            "month": "June",
            "year": "2017"
        },
    {
            "title": "Helping Students Succeed in their Accounting Studies",
            "author": "Sylvie Deslauriers, PhD",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(1), pp. 22-36",
            "doi": "10.15640/ijat.v5n1a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n1a3",
            "abstract": "This paper describes the contents of a course entitled How to succeed in your accounting studies, which was specifically created to help students do better in those studies. This 15-hour course does not teach accounting per se. Rather, it covers things that students can do to learn more effectively. Several aspects are covered, from reading reference documents to writing exams, in addition to touching on problem solving and identifying key concepts. Because every student learns differently, they are asked to consider various ways of learning to that they can become aware of their own learning style, and then to assess and improve it. Colleagues teaching other courses in the program graciously agreed to provide their materials so that we could compile a series of specific activities that are part and parcel of student life. This educational initiative highlights the need to focus more on things happening outside of classes. For the benefit of their students, the staff involved in teaching                      accounting can readily integrate “learning to learn “tips into their classes.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "1",
            "month": "June",
            "year": "2017"
        },
    {
            "title": "The Temporal Characteristic of Closed-end Municipal Bond Fund Discounts/Premiums",
            "author": "Ronald Woan",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(1), pp. 37-47",
            "doi": "10.15640/ijat.v5n1a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n1a34",
            "abstract": "The primary objective of this study is to investigate, identify and classify the characteristics of the temporal behavior of municipal bond closed-end fund discounts/premiums from a class of linear stochastic autoregressive-integratedmoving average (ARIMA(p, d, q)) models. The secondary objective is to examine the ability of the identified and classified models to forecast out-of-sample closed-end fund discounts/premiums. These objectives are consistent with those of earlier study on domestic equity closed-end funds. Comparisons of the forecasting abilities will be made between the classified ARIMA(p, d, q) and random walk models using mean absolute percent error metric (MAPE) as criterion. Classification results: for the monthly series our results show: out of 27 municipal bond closed-end funds, there are seven following random walk model, seven following ARIMA(1,0,0) model, three following ARIMA (1,1,0) model, four following ARIMA(0,1,1) model, two following ARIMA(1,0,2), one following                      each of ARIMA(1,0,1), ARIMA(2,1,0), ARIMA(2,0,0), and ARIMA(1,1,2) models. For the weekly series our results show: out of 27 municipal bond closed-end funds, there are five following random walk model, thirteen following ARIMA(1,0,0) model, five following ARIMA(0,1,1) model, two following ARIMA(2,1,0) and one following each of ARIMA(0,1,2), and ARIMA(1,0,1) models. Except for one week out of the four weeks examined the forecast results for the weekly municipal bond closed-end funds do not show significant difference between the fund-specific ARIMA (p, d, q) models and the random walk model.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "1",
            "month": "June",
            "year": "2017"
        },
    {
            "title": "Information Saliency, Auditors’ Analytical Assessments and Learning",
            "author": "Minwoo Lee, Hyun S. Hwang",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(1), pp. 48-67",
            "doi": "10.15640/ijat.v5n1a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n1a5",
            "abstract": "This study performed an experimental investigation using expert subjects on how different information conditions affect auditors’ probability judgments regarding customer account default in a setting of analytical procedure. This study achieved significant improvements in experimental design issues identified in previous studies in this area, and also addressed unexplored issues. The study found the saliency level of prior probability of the account default negatively affected the magnitude of probability assessment errors. These results based on expert subjects are different from those with non-expert subjects in the previous literature. Previously, the saliency of prior probability was not found to significantly affect the magnitude of probability assessment error. Despite that the subjects were found to generate bias in probability judgments, the magnitude of the error decreased over time with the subjects’ learning from feedback. This learning effect was significant in the condition w                     here the prior probability of default was more salient. This significant learning effect resulted in improvement in probability assessments over time with a reduction of the probability judgment error by a substantial amount.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "1",
            "month": "June",
            "year": "2017"
        },
    {
            "title": "Corporate Effective Tax Rates in the Financial Services Sector: Evidence from Nigeria",
            "author": "Yinka Mashood Salaudeen, PhD",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "5(1), pp. 68-88",
            "doi": "10.15640/ijat.v5n1a6",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v5n1a6",
            "abstract": "This study determines the Effective Tax Rates (ETRs) being experienced by firms within the financial services sector. It also examines the neutrality and the determinants of these rates. The study adopts a micro-backward looking approach. Data were extracted from the annual reports of sample firms which cut across the sub-sectors of monetary intermediation, insurance and auxiliary services from 2010 to 2013. GAAP ETR and CASH ETR were separately regressed against firm size, firm leverage, capital intensiveness, nature of business and profitability in a Pooled OLS Multiple Regression Model. Finding suggests that both variants of ETR were below the Statutory Tax Rate through-out the period of study. It further shows that the monetary intermediation sub-sector bears a lower ETR than the insurance subsector while auxiliary services sub-sector pays the highest effective tax and that there is tax dispersion within the sector. The regression results show that profitability, firm leverage and cap                     ital intensiveness as the determinants of the both GAAP ETR and CASH ETR. The robustness checks in a Random Effect Model, to a large extent, confirm the OLS results. Findings also provide evidence to support the political clout theory. The policy implication of the findings lays in the need for further tax incentives for the auxiliary services sub-sector.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "5",
            "issue": "1",
            "month": "June",
            "year": "2017"
        },
    {
            "title": "The Marriage Tax Penalty in 2015",
            "author": "Weldon Terry Dancer",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(2), pp. 1-11",
            "doi": "10.15640/ijat.v4n2a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v4n2a1",
            "abstract": "Many people believe Congress enacted legislation to eliminate the Marriage Tax Penalty for low income taxpayers. This paper investigates this belief and finds though Congress has enacted legislation to reduce or eliminate the Marriage Tax Penalty, many low income taxpayers still suffer from a substantial Marriage Tax Penalty. In 2015, a married couple with two children where each spouse earned $18,000 incurred a Marriage Tax Penalty of $4,366, a penalty more than $1,000 greater than a similar couple earning $120,000.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "2",
            "month": "December",
            "year": "2016"
        },
    {
            "title": "Senior Level Accounting Course Performance and the Timing of Completing Intermediate Accounting I",
            "author": "Marie Archambault, Jeffrey Archambault",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(2), pp. 12-24",
            "doi": "10.15640/ijat.v4n2a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v4n2a2",
            "abstract": "This study examines whether student performance in senior level accounting courses is a function of how soon the course is taken after Intermediate Accounting II. The classes considered at the senior level are Advanced Accounting, Auditing, and Senior Seminar (the Capstone Experience). The results indicate that course sequencing does influence performance in the senior-level courses. The grade received in the senior level accounting courses is adversely affected by the length of time between that course and Intermediate Accounting II for both Auditing and Advanced Accounting, but not for Senior Seminar. Other control variables that were found significant in determining student performance in senior-level courses were the student=s grade in Intermediate Accounting II and overall GPA.ACT scores were shown to not significantly influence the grade received in the senior level accounting courses. These results have implications for student course sequencing through their program and for advisi                     ng of students..",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "2",
            "month": "December",
            "year": "2016"
        },
    {
            "title": "Corporate Inversions: New Challenges, New Opportunities",
            "author": "Dr. James N. Mohs; Martin A. Goldberg, J.D., LL.M; Lanzi W. Butler, M.S.T; Amanda M. Heath, M.S.T. (Candidate",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(2), pp. 25-35",
            "doi": "10.15640/ijat.v4n2a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v4n2a3",
            "abstract": "With a wave of recent tax inversion and corporate reorganization discussions, corporate tax strategy has begun to move to the forefront of media, public and Congressional attention. These high-profile inversion strategies have gained momentum and achieved heightened attention, becoming a matter of public policy matter in 2014. While corporate international tax strategies have existed since the dawn of the U.S. federal income tax, inversions in their current form have been active only since the 1980s. Using three predominate inversion cases as a lens; this research intends to fill a gap in the existing literature relating to corporate inversions. By combining existing case law, tax legislation, and Treasury regulations, this paper develops a framework for supporting strategic global tax initiatives. The conclusions and recommendations reached are generalizable and appropriate for use in developing best practice solutions.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "2",
            "month": "December",
            "year": "2016"
        },
    {
            "title": "Documentation of Transfer Pricing: A New Global Approach",
            "author": "Wagdy M. Abdallah",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(2), pp. 37-55",
            "doi": "10.15640/ijat.v4n2a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v4n2a34",
            "abstract": "This research paper investigates two important tax issues: (a) an investigation of global documentation of transfer pricing around the world and suggests a new approach for managing transfer pricing documentation and (b) a comparison between the Organization for Economic Cooperation and Development (OECD) guidelines and the documentation requirements of selected countries. Multinational companies (MNCs) should design a well workable transfer pricing systems to comply with documentation tax rules of all countries, otherwise; huge penalties will be imposed. This paper suggests the use of a three-tiered approach, which is called a regional documentation file, for transfer pricing. The suggested approach is a modification of the ones suggested by the OECD. It will include information about regional business and economic conditions of the region, a description of the intangibles used for this specific area, and consolidated financial statements by region and tax documents. Moreover, it will ma                     ke a significant cost reduction for MNCs in the preparation of transfer pricing documentation.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "2",
            "month": "December",
            "year": "2016"
        },
    {
            "title": "Presumptive Taxation in Ukraine Assessment of Previous and Current Systems from the Fiscal Perspective",
            "author": "Iryna Serbinenko",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(2), pp. 56-78",
            "doi": "10.15640/ijat.v4n2a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v4n2a5",
            "abstract": "From the business and individuals perspective taxes are burden. And from the governments perspective taxes are revenues. The constant conflict of interests has dramatic outcomes for every side. The main of them are shadow economy and corruption. These issues are very painful for developing and transition countries. Their tax legislation is deficient. That’s why in these countries taxpayers are vulnerable to different violations of tax administration. The other problem which is caused by deficient tax legislation is lack of understanding and predictability. That in turn is additional reason for decreasing of tax revenues and increasing of shadow economy. My thesis focuses on Ukrainian special tax regime for individual entrepreneurs (sole proprietors) and SMEs. Main objectives of simplified (presumptive) tax system for small taxpayers are: (i) to decrease the tax compliance costs and (ii) to increase the ability of tax authorities to concentrate on working with large and medium size compani                     es. I argue that implementing of simplified (presumptive) tax system (STS) for sole proprietors and SMEs was necessary step for further development of Ukraine economy. My work is based on previous academic researches and on data from official sources. The main finding of my thesis is that both previous and current Ukraine’s STSs failed to achieve two main goals of special regimes for small taxpayers. I make a conclusion that a presumptive tax system is very important fiscal tool for developing countries but in order to be effective it has to be well designed and fully integrated into general tax regime.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "2",
            "month": "December",
            "year": "2016"
        },
    {
            "title": "An Investigation on the Relationship between Corporate Governance and Growth Strategy with Value Creation in Tehran Stock Exchange (TSE)",
            "author": "Abdolreza Ghasempour",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(2), pp. 79-97",
            "doi": "10.15640/ijat.v4n2a6",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v4n2a6",
            "abstract": "The present paper evaluated the role of corporate governance and growth strategy on value creation. As for the variables of value creation, economic value added, market value added, Jensen's alpha, return on assets, and return on equity were examined, sales growth and income growth were considered for growth strategy, and variables of percentage of institutional investors, percentage of non-bound members, CEO duality, CEO replacement, and auditor tenure were used as indicators of corporate governance. For testing research hypotheses, the authors utilized multiple regression and financial data of 111 sample companies for the period of 2001 to 2010. The findings indicated that sales growth was positively associated with all indices of value creation. However, income growth was only positively associated with the return on assets. Moreover, economic value added was solely positively associated with CEO duality. There were no associations whatsoever between market value added and Jensen's alp                     ha as well as all indices of corporate governance. A negative and significant relationship was observed between return on assets and auditor tenure, and finally, return on equity was negatively associated with auditor tenure and CEO replacement. According to the results, corporate governance had little to do with value creation in Iran.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "2",
            "month": "December",
            "year": "2016"
        },
    {
            "title": "Accountability of Non-Government Organization from the Perspective of Stakeholder Theory",
            "author": "Anik Yuesti, Luh Gde Novitasari, Ni Wayan Rustiarini",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(2), pp. 98-119",
            "doi": "10.15640/ijat.v4n2a7",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v4n2a7",
            "abstract": "This study aims to see the accountability of non-government organization from the perspective of Stakeholder theory. Accountability in its practice and theory has weaknesses. The weaknesses are lacking of supervision of disbursement and neglecting people’s culture (Dixon et al., 2006); lacking of information in organization (Kovach et al., 2003); financial statements that are submitted only to the donors (Goddard and Assad, 2006); and the many scandals and abuses of power in organizations (Gibelman and Gelman, 2001). However, this agency theory cannot be applied by NGOs because they are social organizations (Dixon, et al., 2006). Therefore, it is interesting to know the practices and the accountability of NGO. The researcher used interpretive existential phenomenology method to understand a phenomenon (Burrel dan Morgan, 1994; pp.243-247). Stakeholder theory is used to analyze problems with MBM organization activity assumption, which is related to the donors and community. The results of                      the research show that accountability based on stakeholder perspective theory is for all stakeholders. They are the owners, the management, and social. Stakeholder theory does not emphasize on vertical relationship or the relationship with God as the Owner.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "2",
            "month": "December",
            "year": "2016"
        },
    {
            "title": "Ease of Communication with Supervisors and Auditors’ Information Search Behavior",
            "author": "Yee-Chy Tseng, Ruey-Dang Chang",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(2), pp. 120-140",
            "doi": "10.15640/ijat.v4n2a8",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v4n2a8",
            "abstract": "This study examines whether ease of communication with supervisors has a positive effect on the breadth and depth of information search that takes place in the execution of an audit assignment. 132 auditors with 2-to-5 years of audit experience participate in a questionnaire survey on the information search behavior the last time they performed a typical audit for a for-profit client. The result shows that ease of entering has a positive and significant correlation with both breadth and depth of information search.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "2",
            "month": "December",
            "year": "2016"
        },
    {
            "title": "Accounting for Internally Generated Intangible Assets",
            "author": "Steven W. Smalt, PhD, CPA ; J. Marshall McComb II, MAcc, CPA",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(1), pp. 1-15",
            "doi": "10.15640/ijat. v4n1a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v4n1a1",
            "abstract": "Intangible assets have become a major factor driving value creation in the modern global economy. Despite this, many inconsistencies exist in the presentation of intangible assets in financial statements, often under representing internally generated intangible assets as compared to purchased intangible assets. These inconsistencies in accounting treatments make comparisons both in the current period as well as future periods pronounced and material. This article compares and contrasts current treatment requirements of both IFRS and US GAAP and proposes an alternative that provides consistent accounting application and greater comparability of essentially identical transactions.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "1",
            "month": "June",
            "year": "2016"
        },
    {
            "title": "Common Consolidated Corporate Tax Base (Ccctb) In the Theory of Corporate Finance",
            "author": "Jolanta Iwin-Garzyńska",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(1), pp. 17-51",
            "doi": "10.15640/ijat. v4n1a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat. v4n1a2",
            "abstract": "One of the main objectives to be accomplished by the European Union law is to eliminate barriers to the functioning of domestic market and in particular improve the competitiveness of enterprises. After several years of efforts, on 16 March 2011 the European Commission approved a proposal for the directive on a Common Consolidated Corporate Tax Base which is to remove obstacles to the functioning of internal market and increase tax harmonization in the EU. The article is aimed at presenting the essence of CCCTB in the theory of corporate finance and its importance for enterprises, based on the survey of Polish and EU companies. The paper addresses issues relating to tax in corporate finance. Canons of taxation will be discussed and special emphasis will be placed on principles behind formulating fiscal law provisions (including the EU law). Furthermore, the article presents the results of surveys into the importance of taxation cannons for Polish and EU companies. Attention will also be p                     aid to taxable income and deductible expenses with special reference to non-taxable income and non-deductible expenses. The proposal for the directive on CCCTB will be compared with fundamental theories of corporate finance – such as the theory of capital structure",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "1",
            "month": "June",
            "year": "2016"
        },
    {
            "title": "The Effect of Tax Avoidance on Government Budget Implementation in Southwest Nigeria",
            "author": "AKINLEYE, Gideon Tayo ; OGUNMAKIN, Adeduro Adesola",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "4(1), pp. 53-68",
            "doi": "10.15640/ijat. v4n1a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat. v4n1a3",
            "abstract": "The study examined the effect of tax avoidance on government budget implementation in Southwest Nigeria for the period 1999-2014. Out of the six states in Southwest Nigeria (Lagos, Ondo, Ekiti, Oyo, Osun and Ogun), simple random sampling was used to select Ekiti, Ondo, Osun and Ogun states. Secondary data on VAT, PAYE, CGT, and WIT were gathered from office of Budget and Economic Planning, Research Department and Internal Revenue office of sampled Southwest states. The estimated parameters for tax avoidance variables from the model were statistically significant at 0.05 for assessing and determining the performance of budget implementation. Descriptive and inferential statistics were used to analyse the data. The f-statistic value 5.409 and the probability of f -statistic 0.0005 revealed that the panel regression model was appropriate, valid, reliable, and acceptable for the study. The results showed that 61 percent of the expected revenue of the states was hampered by avoidable consequen                     ce of tax avoidance through non compliance with collection and remittances. The level of tax avoidance through implementation of tax laws and policies in Southwest Nigeria revealed negative performance of government budget implementation and as such affected the development of the economies of sampled states (t = 3.84, 6.36 and 9.94 for VAT, CGT and WIT respectively). The study concluded that there is a linear relationship among three out of the four independent variables considered (VAT, CGT and WIT) and budget implementation in South West Nigeria. The study recommended that government should develop a well equipped database aiming at identifying all possible sources of tax avoidance by companies and individual tax payers, which will help in checking truancy of tax payers, thereby leading to reduction in non compliance and remittances of appropriate tax dues. It was equally recommended that state governments should establish proper accountability and transparency agencies to monitor the                      collection and remittances of tax revenue. Tax agencies must be strictly positioned to discourage every form of unwholesome or corrupt practices connected with the tax system.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "4",
            "issue": "1",
            "month": "June",
            "year": "2016"
        },
    {
            "title": "The Unintended Consequences of Sarbanes Oxley Act",
            "author": "Dr. Kingsley Wokukwu",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "3(2), pp. 1-13",
            "doi": "10.15640/ijat.v3n2a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v3n2a1",
            "abstract": "This paper argues that Sarbanes Oxley Act has given investors a fresh breath of life with a renewed sense of confidence in the US financial market. Sarbanes Oxley Act tend to minimize corporate collapses, audit failures and litany of financial restatements that permeated the corporatearena, the financial market several years and bred deep cynicism and public anger. Sarbanes Oxley Act is signed into the law to restore confidence in investing public and financial markets through a combination of rules and oversight that address conflict of interest on investor side and the lack of accountability on the corporate side to improve corporate governance. It aimed at to compensate for the failure of governances that culminated in Enron, WorldCom and Tyco financial scandals. Corporate managers are being held accountable for corporate governance and Sarbanes Oxley Act also detects what firms can and cannot do. All corporate senior officers and participants in the preparations of published financial                      reports have increased responsibilities and consequences for failing to leave up to the standard and responsibilities. Due to SOX, the top corporate officers such as the CEO and CFO are required to take personal responsibility by certifying both quarterly and annual financial statements and disclosure. Firms have better internal control environment as a result of Sarbanes Oxley Act. This translates to a more accurate and reliable information conveyed to investors who would rely on published financial statements to make informed investments decisions.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "3",
            "issue": "2",
            "month": "December",
            "year": "2015"
        },
    {
            "title": "An Evaluation of the Impact of Corruption, Tax Burden, and Income on the Size of the Shadow Economy",
            "author": "ILIR BINAJ CPA, CGMA, EKR",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "3(2), pp. 15-27",
            "doi": "10.15640/ijat.v3n2a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v3n2a2",
            "abstract": "The objective of this research is to examine the effect of corruption, tax burden, income, and tax administration efficiency on the size of the shadow economy. In this study, we have investigated the size of the shadow economy of 50countries. We provide empirical evidence and explanation for the vicious circle of tax evasion and political corruption in which many developing countries, and sometimes even developed countries, often fall into. Also, an important relation between the level of income and tax evasion is identified. In the end, recommendations are made for policy makers. We find that standard prevention policies, that sometimes have a short-term effect, do not offer a real long-term solution for tax evasion and corruption; instead, policies and measures that impose a strong moral cost on corrupt politicians and on tax evaders can lead to a permanent reduction of both.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "3",
            "issue": "2",
            "month": "December",
            "year": "2015"
        },
    {
            "title": "“An Analysis of Corporate Sponsorship of Tax-Exempt Organizations and the Unrelated Business Income Tax”",
            "author": "Brian K. Leonard",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "3(1), pp. 1-14",
            "doi": "10.15640/ijat.v3n1a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v3n1a1",
            "abstract": "Throughout the history of the unrelated business income tax (“UBIT”), corporate sponsorship of exempt organizations has been a controversial issue. This is because of the competing interests of corporate responsibility and citizenship and tax policy implications. Thus, this paper will examine this area of law and taxation and discuss how Congress, the courts, and the IRS have struggled to strike the right balance in between establishing consistent and appropriate tax regulations and the encouragement of funding for tax-exempt organizations. This paper will examine the history of corporate sponsorships and the UBIT, including the laws, cases, and regulations that have been promulgated in this area. In addition this paper will highlight the reality that due to the importance of these sponsorships to exempt organizations, and the resulting political sentiment surrounding them, it is unlikely that they will ever be completely subject to the UBIT, and as a result the debate over the taxation o                     f these activities will continue for the foreseeable future.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "3",
            "issue": "1",
            "month": "June",
            "year": "2015"
        },
    {
            "title": "Inter-Governmental Fiscal Relationships of Municipalities in Argentina and Mexico",
            "author": "Marcela Astudillo Moya, Maria Isabel Garcia Morales",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "3(1), pp. 15-30",
            "doi": "10.15640/ijat.v3n1a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v3n1a2",
            "abstract": "This work analyzes the fiscal relationships of municipalities in Argentina and Mexico with both provincial and state governments and the federal government. It focuses on the laws that regulate the municipal regime and the tax regulations of both countries. The result confirms the hypothesis that even in federal systems, the municipalities of Latin America are fiscally subordinate to state or provincial and national governments. This runs contrary to one of the essential characteristic of federalism, which is the decentralization and thus the autonomy of local governments.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "3",
            "issue": "1",
            "month": "June",
            "year": "2015"
        },
    {
            "title": "Volunteer Valuation -- Incorporating Volunteer Capacity into Nonprofit Financial Reporting: A Research Service Learning Project",
            "author": "Karen A. Maguire",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "3(1), pp. 31-53",
            "doi": "10.15640/ijat.v3n1a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v3n1a3",
            "abstract": "The objective of this project is to evaluate options that allow Nonprofit Organizations (NPOs) to: - Incorporate contributions of volunteers into an NPO’s accounting system;- Provide recommendations for auditing assertions of volunteer contributions; - Incorporate volunteer hours into the financial reporting process; - Demonstrate increased and sustained capacity to both internal and external stakeholders;- Incorporate different rates for different volunteer work; - Tie results with the Unified Chart of Accounts since it is compatible with Generally Accepted Accounting Principles, United Way, Internal Revenue Service Form 990, and the United States Office of Management and Budget federal grant reporting;and - Show how including volunteer hours in financial statements helps Grantmakers understand an NPO’s true capacity.The process presented in this paper allows NPOs to reduce the costs associated with hiring an auditor while achieving best practices. This allows NPOs to value their volunteers and demonstrate their successful and sustainable capacity building efforts to stakeholders. When NPOs can demonstrate their true capacity, this increases opportunities to obtain additional funding, including those types of funding which require audits. The opposite of a vicious cycle, it is a capacity cycle that leads to greater output, outcomes, impact, and capacity building.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "3",
            "issue": "1",
            "month": "June",
            "year": "2015"
        },
    {
            "title": "The Impact of Ownership Duality on Firm Performance in Egyptyte",
            "author": "Masry, Mohamed",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "3(1), pp. 54-73",
            "doi": "10.15640/ijat.v3n1a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v3n1a4",
            "abstract": "Corporate governance is considered to have significant implications for the growth prospects of an economy. Good corporate governance practices are regarded as important in reducing risk for investors, attracting investment capital and improving the performance of companies. The purpose of this study was to examine the relationship between corporate governance practices and firm performance in Egypt, as a result of the adoption privatisation since 1996 and the extent of changes to corporate governance practices. During this period, the firms that operated in Egypt were affected by political and economic transformation. The theoretical basis for this study was agency theory, which focuses on the ownership duality and control. The conceptual framework of the study described how the board structure in Egypt impacted on firm performance. In this framework corporate governance were be indicated ownership duality. Ownership duality refers to the separation of the position of chairman and CEO. T                     he research explored the relationship of this variable to firm performance. Firm performance was assessed by Return on equity, Return on assets and Tobin’s Q. This is the first study conducted in Egypt on corporate governance and firm performance during periods of high volatility in the environment due to adverse economic and political conditions after the 25th of January’s revolution. As a result, this study makes a significant contribution to the body of knowledge on corporate governance in developing countries and illustrates how corporate governance impacts on firm performance in unstable political and economic environments such as that experienced in Egypt. This study is a comparative analysis to measure the changes to corporate governance practices from 2005 to 2012. A sample of 42 companies was selected from the top 100 listed companies in EGX 100(Egyptian stock exchange). The selection was determined by the availability of data for both years. Data were obtained from annual report                     s and the Egyptian Capital Market Authority. In addition, key accounting data as well as annual reports were obtained from the following sources: Cairo and Alexandria Stock Market Exchanges (CASE) and financial year book (financial statements from 2005 to 2012).The data were analysed with SPSS to obtain quantitative measures of descriptive statistics, Spearman’s correlation and analysis of variance. Descriptive statistics from the study showed positive relationship for separate leadership and firm performance based on return on equity. In this study, the positive relationship between corporate governance structures, separate leadership, and firm performance indicate that firms have implemented corporate governance strategies, which have resulted in higher profitability and share price performance.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "3",
            "issue": "1",
            "month": "June",
            "year": "2015"
        },
    {
            "title": "Development and Evaluation of a Prototype web XBRL-Enabled Financial Platform for the Generation and Presentation of Financial Statements according to IFRS",
            "author": "Elissavet Stergiaki, Athanasios Vazakidis, Antonios Stavropoulos",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "3(1), pp. 74-101",
            "doi": "10.15640/ijat.v3n1a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v3n1a5",
            "abstract": "The main objective of IFRS is to provide a common qualitative accounting basis and to promote greater transparency and comparability of financial reporting across the world. However, the success of IFRS depends on how financial information flows within the company and in which format is represented to outside users. Therefore, accounting information systems and web financial applications should meet the qualitative criteria of IFRS. Also, it is necessary to introduce new advanced technologies that will be able to electronically describe the new business language, XBRL. The purpose of this paper is to study accountants’ perceptions to use eXtensible Business Reporting Language (XBRL), investigating the implications of implementing an XBRL project in the Greek capital market. In addition, a pilot model for Web financial reporting, using XBRL, was developed and specifically evaluated. The results indicated that this pilot model is a financial environment where accountants can easily and qu                     ickly find, parse, edit and exchange useful and meaningful accounting information. This empirical study revealed that both: a) Greek companies by their prospective adoption of XBRL b) Greek capital market by implementing a sophisticated web financial reporting model seek for the generation and presentation of high quality accounting data.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "3",
            "issue": "1",
            "month": "June",
            "year": "2015"
        },
    {
            "title": "The Ideological Mentality of an Accounting Student at a Crossroads (The Case of Bahrain)",
            "author": "Riyadh Al-Abdullah",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "3(1), pp. 102-138",
            "doi": "10.15640/ijat.v3n1a6",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v3n1a6",
            "abstract": "The accounting teaching process at the University of Bahrain (UoB) reflects competition of three sources of ideological influences with each having two main tendencies: the ethicallybased goal, i.e. profit/wealth maximization vis-à-vis social welfare and the ethically-based teaching approach to beliefs, i.e. indoctrination vis-à-vis education. The three sources are the Bahrain cultural values dominated by Islamic Shari'a and Arabic system of values with a tendency toward social welfare goal and indoctrination, the traditional school of accounting ethics permeated by Milton Friedman's single social responsibility doctrine restricted solely within achieving cash profit/wealth maximization with a tendency toward indoctrination and the non-traditional school of accounting ethics dominated by a belief in true social responsibility with a tendency toward education. Though an empirical investigation based on four samples of accounting students at UoB, this paper tries to demonstrate that the thr                     ee sources of ideological influence compete to dominate the mentality of an accounting student. Although the empirical investigation shows that the traditional school of accounting ethics slightly has an upper hand over both the Bahrain cultural values and the non-traditional school of accounting ethics, the ideological mentality of an accounting student is really at a crossroads. This orientation in the teaching process must be encouraged since it makes accounting a vivid, lively and illuminating science of knowledge. The current teaching process at UoB allows both accounting indoctrination and accounting education to ideologize together2.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "3",
            "issue": "1",
            "month": "June",
            "year": "2015"
        },
    {
            "title": "The Effect of Dividend Tax on Earnings and Contributed Capital in Firm Valuation",
            "author": "Chia-Chun Hsieh, Ling-Yi Chou",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "3(1), pp. 139-162",
            "doi": "10.15640/ijat.v3n1a7",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v3n1a7",
            "abstract": "Earlier research applies theoretical valuation models in studying tax capitalization, an effect that results in different pricing on contributed capital, retained earnings, and net income due to dividend taxes. There are also debates regarding whether it is appropriate to apply the price-level model in empirical research, because the coefficients may be sensitive to model specifications. To further explore this issue, this paper investigates tax capitalization in different tax regimes, where individual dividend tax rates vary across countries and over time. First, we compare U.S. with Canada, which are similar in environment but different in the level of double taxation on dividends. We find differential pricing on retained earnings and contributed capital, but the magnitudes are inconsistent with the theory. Second, we examine a statutory tax rate change in Taiwan in 1998 when an “integrated” income tax system was implemented to alleviate double taxation on dividends. We find that change                     s in the pricing on retained earnings coincide with changes on dividend tax, but the results on the relationship between contributed capital and retained earnings are mixed. The results are more consistent with the argument that caution should be exerted when applying the model in studying tax capitalization effect.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "3",
            "issue": "1",
            "month": "June",
            "year": "2015"
        },
    {
            "title": "An Examination of the Factors Affecting Students’ Decision to Major in Accounting",
            "author": "Jason Porter, Darryl Woolley",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(4), pp. 01-22",
            "doi": "10.15640/ijat.v2n4a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n4a1",
            "abstract": "We conducted a survey of accounting and non-accounting students to determine what influences a student to major in accounting. We validated our constructs using principal components and tested our hypotheses that accounting students would view career objectives as more important, and that non-accounting students would view intrinsic characteristics of their major as being more important. As expected, we found that accounting students place more emphasis on career objectives and less emphasis on the intrinsic characteristics of their major than non-accounting students. The difference in opinion on intrinsic characteristics – accounting students think that accounting is better intrinsically than non-accounting students, and nonaccounting students thinking their own major much more intrinsically rewarding than accounting – was a more powerful predictor than differences in opinion on career outcomes. These findings provide guidance to accounting programs that they can communicate the intrinsi                     c rewards of majoring in accounting to attract more students.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "4",
            "month": "December",
            "year": "2014"
        },
    {
            "title": "The Anatomy and Synthesis of Financial Fraud",
            "author": "Dr. Kingsley Wokukwu",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(4), pp. 23-47",
            "doi": "10.15640/ijat.v2n4a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n4a2",
            "abstract": "This paper explores the synthesis and anatomy of financial fraud and factors that led to the fraudulent financial reporting. It examines the role accounting rules and standards, regulators, auditors and regulatory capture played in misleading published financial reports. This paper finds that the broad nature of accounting rules manifests the deliberate actions of some corporate executives to engage in earnings manipulation, income smoothing, improper revenue recognition or realization and earnings management to meet predetermined earnings projections. The SEC deems these practices as abusive, materials and intentional misrepresentation of financial information. This paper postulates that the actions of the corporate executives to take adverse advantage of the broad nature of accounting rules grossly violates GAAP requirement and precludes transparency in the published financial reports. This paper finds that the practices of some auditors violate The Standards for the Professional Practi                     ce of Auditing which requires auditors to alert all concerned the possibility of intentional fraudulent accounting informationand the auditors should have sufficient knowledge to recognize the indicators for potential fraud.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "4",
            "month": "December",
            "year": "2014"
        },
    {
            "title": "The Influence of the Culture on Managers’ Capital-Budget Decisions",
            "author": "Dr. Lijuan Zhao",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(4), pp. 49-55",
            "doi": "10.15640/ijat.v2n4a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n4a3",
            "abstract": "Some researches in behavior accounting focus on the emotional affect and examine the influence of the emotional affect especially negative affect on capital budget decision-making. Kida, Moreno and Smith (2001) find that these affective reactions especially negative affect will influence managers' capital-budgeting decisions; managers will reject alternative that elicit negative affect even though it has higher economic values. Kida and Smith (2002) provide evidence that affective reaction will influence managers’ risk-taking tendency in capital-budget decisions. However, these two studies fail to consider the role of different level individualism when they investigate the influence of affect on decision-making. Therefore, this study extends Kida et. al (2001) to investigate the role of culture in the context of affect and decision-making. This study finds that managers who are from low-individualism cultures are less likely to reject the alternatives that elicit negative affect but havin                     g high economic values than those managers who are from high-level individualist cultures.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "4",
            "month": "December",
            "year": "2014"
        },
    {
            "title": "Can Universities Help to Satisfy Accounting Practitioners’ Needs: A Survey of Responses of Accounting Academics’ to Accounting Practitioners’ Perceptions of Weaknesses and Strengths of Accounting Graduates in Hong Kong",
            "author": "Professor Theodore T. Y. Chen",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(4), pp. 57-80",
            "doi": "10.15640/ijat.v2n4a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n4a4",
            "abstract": "Purpose: This study seeks to obtain Hong Kong accounting academics’ responses to weaknesses and strengths perceived by major accounting employers of Hong Kong accounting graduates. Design/ Methodology/ Approach: This is a qualitative study consisting of two phases. The first phase relates to identifying the weaknesses and strengths of university graduates by sending a Likert-scale questionnaire to the big-4 accounting firms. The second phase consists of interviewing accounting academics. In areas where improvements are sought, suggestions for remedial activities from each surveyed institution as well as the reasons as to why some institutions cannot help are recorded. In areas where the graduates have done well, the institutions’ responses include whether these have been the results of their efforts, or that credit cannot be claimed. Findings:Common approaches suggested to enhance the skill sets in several areas include the use of case studies, instructional materials and exam questions t                     hat are unstructured and ambiguous, projects or presentations requiring interactivity and encouraging students to participate more in student and external activities with the universities arranging more internships, study tours and exchange programs. The use of the aforementioned factors also contributed to accounting graduates doing well in several areas. Research Limitations:This paper is based entirely on a survey of expert opinions from both major accounting employers and accounting academics. It would not be appropriate to use statistical tools under these circumstances. Practical Implications: The results of this study can be used as a reference by accounting academics in countries or jurisdictions where the educational and business environments are similar to those in Hong Kong. Social Implications:After reading this paper, accounting practitioners would have a clear understanding of what universities can and cannot do in the nurturing of the expected skillsets of accounting gradua                     tes. Hence, they should not point fingers at accounting academics for doing a less than adequate job for not being able to overcome some of the perceived weaknesses of accounting graduates. Originality: This is a topic that has never been explored previously.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "4",
            "month": "December",
            "year": "2014"
        },
    {
            "title": "Review of Empirical Literature on Audit Quality and Cost of Debt Capital",
            "author": "Alireza Eskandai, Assoc. Prof. Dr.Siti Zaleha Abdul Rasid, Dr. Rohaida Basiruddin, Mohammad Reza Hosseini",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(4), pp. 81-92",
            "doi": "10.15640/ijat.v2n4a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n4a5",
            "abstract": "This paper reviews empirical studies over the past decades in order to assess what researchers have done about the impact of audit quality on the cost of debt capital. Audit quality encompasses of an external mechanism intended to mitigate information asymmetry by increasing the monitoring of management’s actions, limiting managers’ opportunistic behavior, and improving the quality of firms’ information flows.A stream of literature explains that audit quality of external auditor mechanisms such as auditor size, audit fees, non-audit services and auditor industry specialization are able to contribute towards improving the firm’s performance and reducing information asymmetry. The other dimension of value creation is the reduction in the cost of debt capital raised by firms. Theoretically and empirically to some extent, high audit quality of external auditors will lead to lower firm risk, information asymmetry and subsequently, a lower cost of debt capital. This paper aims to provide a crit                     ical review of the empirical literature on the effect of audit quality on the cost of debt capital.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "4",
            "month": "December",
            "year": "2014"
        },
    {
            "title": "Sustainability Accounting Reporting: A Survey on 30 U.S. Dow-Jones Companies",
            "author": "Ying Guo, David C. Yang",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(3), pp. 01-15",
            "doi": "10.15640/ijat.v2n3a1",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n3a1",
            "abstract": "The objective of this paper is to examine the development of sustainability accounting and reporting in practice, and to observe the reporting patterns and standards followed through a survey on reporting frameworks of U.S. large companies (Dow-Jones 30 companies). This paper first reviews and summarizes the recent literature in sustainability accounting research, particularly in sustainability accounting reporting. Further, the paper provides a survey on sustainability accounting reportingframe works of 30 U.S. Dow-Jones companies. The findings of this study confirm the increasing trend of sustainability reporting among large publicly traded firms, which is suggested by prior accounting research.However, we observevarious reporting formats and patterns among these 30 Dow-Jones companies.Thisimplies that the lack of uniformity of sustainability reporting and assurance might reduce the comparability, effectiveness and accuracy of sustainability accounting reportin",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "3",
            "month": "September",
            "year": "2014"
        },
    {
            "title": "What trend for Comprehensive Income Presentation? Evidence from Italy",
            "author": "Tiziana De Cristofaro, Barbara Falzago",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(3), pp. 17-40",
            "doi": "10.15640/ijat.v2n3a2",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n3a2",
            "abstract": "Since 2007, IAS 1 has introduced two alternative formats (single-statement or twostatement) for the Comprehensive Income presentation into financial statements. The paper proposes a three-year period survey on annual reports of Italian nonfinancial services listed companies that aims to examine in terms of a trend-oriented analysis both the companies’ format choices and the Other Comprehensive Income (OCI) aptitude to explain such choices. The results show that, during the period considered: a) the two-statement option is chosen more often; b) companies rarely change the format; c) there is a constantly low association, or even independence, between the format and the OCI’s consistency, sign and size. These findings confirm that Italy uses the format closer to the national accounting tradition and suggest that the reasons for this choice have to be looked for elsewhere than the OCI. This analysis can be useful both to standard setters, to verify how successful the options they established                      are, and to accounting scholars, to design further research on the formats under discussion.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "3",
            "month": "September",
            "year": "2014"
        },
    {
            "title": "Pcaob Inspection Reports: Quality Control and Firms’ Characteristics",
            "author": "Obasi, Rosemary",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(3), pp. 41-54",
            "doi": "10.15640/ijat.v2n3a3",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n3a3",
            "abstract": "This study compared the weaknesses identified in the audit engagement performance and quality control (that have been made public by the PCAOB after a lack of progress report within 12 months by the firms) sections of the PCAOB’s published reports. It also, examined the relationship between firms’ characteristics (i.e. size of workforce, number of clients, number of audit offices, and number of audit engagement deficiencies) and PCAOB’s report, to achieve these, 108 PCAOB Inspection reports for inspected firms were analyzed. The reports were grouped into two panels (i.e. clean reports-panel A and unresolved reports-panel B); 52 and 56 firms’ reports respectively were analyzed for each group. The OLS regression results indicate that clean reports are positively and significantly associated with the size of work force, while, it is negatively associated with the number of clients, number of audit offices and number of audit engagement deficiencies. Unresolved reports increase as number of a                     udit offices, and number of audit engagements increase, but it decreases as size of workforce and audit clients increase. We conclude that the number of audit clients is a key quality control determinant as well as the size of work force. We therefore recommend that the PCAOB should encourage firms to increase workforce because, the result of this study has shown that, the number of employees and partners impact greatly on the quality of report by audit firms.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "3",
            "month": "September",
            "year": "2014"
        },
    {
            "title": "Firm-Specific Characteristics and Corporate Financial Disclosure: Evidence from an Emerging Market",
            "author": "Mishari M. Alfraih, Abdullah M. Almutawa",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(3), pp. 55-78",
            "doi": "10.15640/ijat.v2n3a4",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n3a4",
            "abstract": "This study aims to empirically investigate the association between firm-specific characteristics and corporate financial disclosure among Kuwait Stock Exchange (KSE)-listed firms. Consistent with prior disclosure research, the extent of corporate disclosures among all KSE-listed firms in 2010 was measured using a selfconstructed disclosure index. The results show that the mean level of mandatory disclosures for all KSE-listed firms in 2010 was 74% and ranged from 41–95%. The regression results suggest that older, highly leveraged, larger, and profitable KSElisted firms are associated with high levels of disclosures. Importantly, the results reveal significant variations in disclosure levels across the three possible auditor combinations, implying the importance of high quality and rigorous external audits in promoting corporate disclosures. The study contributes to the extant literature by extending corporate disclosure research into the Kuwaiti emerging market that comprise different eco                     nomic, social, political, and cultural characteristics.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "3",
            "month": "September",
            "year": "2014"
        },
    {
            "title": "The “Big Four” and “Sai”– A Case Study on the Management of Financial Audit Independence",
            "author": "Ioan Gheorghe Tara",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(3), pp. 79-97",
            "doi": "10.15640/ijat.v2n3a5",
            "doiURL": "http://dx.doi.org/10.15640/ijat.v2n3a5",
            "abstract": "The process of financial auditing and the auditors themselves must be independent and perceived as such. We analysed a sample of the companies that received financial auditing by the Big Four auditing firms in Romania and that parallel a sample of Romanian Court of Accounts audited companies. The conclusion suggests a difference in the audit opinion of these two groups, which might be the result of direct payment for contracted services or of the lack of such a connection. The lack of any moneyed connection between the auditor and the audited would improve financial audit independence.",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "3",
            "month": "September",
            "year": "2014"
        },
    {
            "title": "Impact of Audit Quality and Financial Performance of Quoted Cement Firms in Nigeria",
            "author": "Musa Adeiza Farouk, Shehu Usman Hassan",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(2), pp. 01-22",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "2",
            "month": "June",
            "year": "2014"
        },
    {
            "title": "Transfer Pricing: The Nigerian Perspective",
            "author": "Ahmed OlatunjiIsau",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(2), pp. 23-38",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "2",
            "month": "June",
            "year": "2014"
        },
    {
            "title": "An Exploratory Analysis of Individual Taxpayers’ Compliance Behaviour in Nigeria: a study of Demographic Differences and Impact",
            "author": "Dr. James O. Alabede",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(2), pp. 39-64",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "2",
            "month": "June",
            "year": "2014"
        },
    {
            "title": "Corporate Governance and Conditional Accounting Conservatism in Nigeria Listed Food and Beverages Firms",
            "author": "Salami Suleiman, Mutalib.Anifowose",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(2), pp. 65-84",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "2",
            "month": "June",
            "year": "2014"
        },
    {
            "title": "Does IFRS Adoption Influence Quality of Reporting?: An Empirical Evidence from Large Canadian Banks",
            "author": "Dr. Yusuf Mohammed Nulla",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(2), pp. 85-109",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "2",
            "month": "June",
            "year": "2014"
        },
    {
            "title": "Comparing Stock Valuation Models for Indian Bank Stocks",
            "author": "Dr. B. Charumathi, Suraj . E. S.",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(2), pp. 111-127",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "2",
            "month": "June",
            "year": "2014"
        },
    {
            "title": "A Primer on the Condition of the Accounting and Auditing Profession",
            "author": "Cole J. Engel",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "2(2), pp. 129-133",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "2",
            "month": "June",
            "year": "2014"
        },
    {
            "title": "Texas Law and Ethics Considerations Regarding Accountants Withholding Work Product and Documents to Enforce Fee Collection",
            "author": "Professor Bruce W. McClain, Professor Scott A. Yetmar",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "01–09",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "1",
            "month": "March",
            "year": "2014"
        },
    {
            "title": "Trends in Management Development during the Reform of the Tax Administration of the Slovak Republic",
            "author": "Ing. Ján Dobrovič",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "11–17",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "1",
            "month": "March",
            "year": "2014"
        },
    {
            "title": "Human Resource Accounting and Decision Making in Post-Industrial Economy",
            "author": "Enyi Patrick Enyi, Adebawojo Oladipupo Akindehinde",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "19–35",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "1",
            "month": "March",
            "year": "2014"
        },
    {
            "title": "Governance Attributes and Real Activities Manipulation of Listed Manufacturing Firms in Nigeria",
            "author": "Shehu Usman Hassan, Garba Ibrahim",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "37– 62",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "1",
            "month": "March",
            "year": "2014"
        },
    {
            "title": "Tax Compliance Costs of Small and Medium Scale Enterprises in Nigeria",
            "author": "Emmanuel Eragbhe, Kennedy Prince Modugu",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "63-87",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "1",
            "month": "March",
            "year": "2014"
        },
    {
            "title": "Financial Liquidity Position of Waroli Co-operative Society of Taluk-Kaprada",
            "author": "Patel Dilipkumar, Patel Alkaben",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "89-100",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "2",
            "issue": "1",
            "month": "March",
            "year": "2014"
        },
    {
            "title": "Working Capital Management and Firm Profitability: Empirical Evidence from Manufacturing and Construction Firms Listed on Nairobi Securities Exchange, Kenya",
            "author": "Daniel Mogaka Makori, Ambrose Jagongo, PhD",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "1",
            "issue": "1",
            "month": "December",
            "year": "2013"
        },
    {
            "title": "Impact of Working Capital Management on Profitability of Micro and Small Enterprises in Ethiopia: The Case of Bahir Dar City Administration",
            "author": "Tirngo Dinku",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "1",
            "issue": "1",
            "month": "December",
            "year": "2013"
        },
    {
            "title": "Measure the Effectiveness of the Rate of Return on Investment in the Evaluation of the Performance of the Commercial Companies - Case Study Fawaz Alhokair and Its Partners",
            "author": "Dr. Alfateh Al-Amin A/Rahim El-Faki",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "1",
            "issue": "1",
            "month": "December",
            "year": "2013"
        },
    {
            "title": "Budgetary Control as a Measure of Financial Performance of State Corporations in Kenya",
            "author": "Kenneth Odour Adongo, Ambrose Jagongo PhD",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "1",
            "issue": "1",
            "month": "December",
            "year": "2013"
        },
    {
            "title": "The Impact of Management Structure and Bank Characteristics on the Level of Compliance with IAS 21: Evidence from Bahrain",
            "author": "Dr. Adel Mohammed Sarea, Hesa Jasim Al Nesuf",
            "journal": "International Journal of Accounting and Taxation",
            "serial": "",
            "doi": "",
            "doiURL": "",
            "abstract": "",
            "pdf": "PDF",
            "category": "Accounting",
            "volume": "1",
            "issue": "1",
            "month": "December",
            "year": "2013"
        }
    
    ]